Repository: OleksandraP/translation
Catalog: methodology/key-concepts/key-concepts.*.xlf
Languages: ru_uk

source: Определения
ru_uk: Визначення

source: [Элемент](#Элемент)
ru_uk: [Елемент](#Елемент)

source: [Модификатор](#Модификатор)
ru_uk: [Модифікатор](#Модифікатор)

source: [БЭМ-сущность](#БЭМ-сущность)
ru_uk: [БЕМ-сутність](#БЕМ-сутність)

source: [Микс](#Микс)
ru_uk: [Мікс](#Мікс)

source: [БЭМ-дерево](#БЭМ-дерево)
ru_uk: [БЕМ-дерево](#БЕМ-дерево)

source: [Реализация блока](#Реализация-блока)
ru_uk: [Реалізація блока](#Реалізація-блоку)

source: [Технология реализации блока](#Технология-реализации)
ru_uk: [Технологія реалізації блока](#Технологія-реалізації)

source: [Переопределение блока](#Переопределение-блока)
ru_uk: [Перевизначення блоку](#Перевизначення-блоку)

source: [Уровень переопределения](#Уровень-переопределения)
ru_uk: [Рівень перевизначення](#Рівень-перевизначення)

source: Логически и функционально независимый компонент страницы, аналог компонента в Web Components.
ru_uk: Логічно і функціонально незалежний компонент сторінки, аналог компонента в Web Components.

source: Блок инкапсулирует в себе поведение (JavaScript), шаблоны, стили (CSS) и другие [технологии реализации](#Технология-реализации).
ru_uk: Блок інкапсулює в собі поведінку (JavaScript), шаблони стилів (CSS) та інші [технології реалізації](#Технологія-реалізації).

source: Независимость блоков обеспечивает возможность их повторного использования, а также удобство в [разработке и поддержке проекта](../solved-problems/solved-problems.ru.md).
ru_uk: Незалежність блоків забезпечує можливість їх повторного використання, а також зручність в [розробці і підтримці проекту](../solved-problems/solved-problems.ru.md).

source: Возможности блоков
ru_uk: Можливості блоків

source: Вложенная структура
ru_uk: Вкладена структура

source: Блоки могут быть вложены в любые другие блоки.
ru_uk: Блоки можуть бути вкладені в інші блоки.

source: Например, блок `head` может включать логотип (`logo`), форму поиска (`search`) и блок авторизации (`auth`).
ru_uk: Наприклад, блок `head` може включати логотип (`logo`), форму пошуку`search`) і блок авторизації (`auth`).

source: ![Составляющие блока Шапка](key-concepts__head_marked.png)
ru_uk: ![Складові блоку Шапка](key-concepts__head_marked.png)

source: Свободное перемещение
ru_uk: Вільне переміщення

source: Блоки можно перемещать в пределах одной страницы, разных страниц или проектов.
ru_uk: Блоки можна переміщати в межах однієї сторінки, сторінок або проектів.

source: Независимая реализация блока позволяет изменять его положение на странице и обеспечивает корректную работу и внешний вид.
ru_uk: Незалежна реалізація блоку дозволяє змінювати його положення на сторінці і забезпечує коректну роботу і зовнішній вигляд.

source: Так, например, логотип и форму авторизации можно поменять местами.
ru_uk: Так, наприклад, логотип і форму авторизації можна поміняти місцями.

source: При этом вносить изменения в CSS или JavaScript-код блока не нужно.
ru_uk: При цьому вносити зміни в CSS та JavaScript-код блоку не потрібно.

source: ![Смена положения блоков](key-concepts__head.png)
ru_uk: ![Зміна положення блоків](key-concepts__head.png)

source: ![Смена положения блоков](key-concepts__head_changed.png)
ru_uk: ![Зміна положення блоків](key-concepts__head_changed.png)

source: Повторное использование
ru_uk: Повторне використання

source: В интерфейсе может одновременно присутствовать несколько экземпляров одного и того же блока.
ru_uk: В інтерфейсі може одночасно бути кілька примірників одного і того ж блоку.

source: ![Товары в интернет-магазине](key-concepts__goods-list.png)
ru_uk: ![Товари в інтернет-магазині](key-concepts__goods-list.png)

source: Элемент
ru_uk: Елемент

source: Составная часть [блока](#Блок), которая не может использоваться в отрыве от него.
ru_uk: Складова частина [блоки](#Блок), яка не може використовуватися у відриві від нього.

source: Например, пункт меню вне контекста блока меню не используется, значит является элементом.
ru_uk: Наприклад, пункт меню поза контекстом блоку меню не використовується, значить є елементом.

source: ![Пункты меню](key-concepts__menu-items.png)
ru_uk: ![Меню](key-concepts__menu-items.png)

source: [Когда создавать блок, когда элемент?](../../faq/faq.ru.md#В-каком-случае-создавать-блок-в-каком--элемент)
ru_uk: [Коли створювати блок, коли елемент?](../../faq/faq.ru.md#У-будь-разі-створювати блок--якому--елемент)

source: [Почему в методологии БЭМ не рекомендуется создавать элементы элементов?](../../faq/faq.ru.md#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2)
ru_uk: [Чому в методології БЕМ не рекомендується створювати елементи элементов?](../../faq/faq.ru.md#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2)

source: Модификатор
ru_uk: Модифікатор

source: БЭМ-сущность, определяющая внешний вид, состояние и поведение [блока](#Блок) или [элемента](#Элемент).
ru_uk: БЕМ-сутність, що визначає зовнішній вигляд, стан і поведінку [блоки](#Блок) або [елемента](#Елемент).

source: Использование модификаторов опционально.
ru_uk: Використання модифікаторів опціонально.

source: По своей сути модификаторы похожи на атрибуты в HTML.
ru_uk: По своїй суті модифікатори схожі атрибути HTML.

source: Один и тот же блок выглядит по-разному благодаря применению модификатора.
ru_uk: Один і той же блок виглядає по-різному завдяки застосуванню модифікатора.

source: Например, внешний вид блока меню (`menu`) может меняться в зависимости от примененного модификатора.
ru_uk: Наприклад, зовнішній вигляд блоку меню (`menu`) може змінюватися в залежності від застосованого модифікатора.

source: ![Добавить меню в подвале](key-concepts__site-footer-menu.png)
ru_uk: ![Додати меню в підвалі](key-concepts__site-footer-menu.png)

source: БЭМ-сущность
ru_uk: БЕМ-сутність

source: БЭМ-сущностями называются [блоки](#Блок), [элементы](#Элемент) и [модификаторы](#Модификатор).
ru_uk: БЕМ-називаються сутностями [блоки](#Блок), [елементи](#Елемент) і [модифікатори](#Модифікатор).

source: Это понятие может применяться как частное, если рассматривается отдельная БЭМ-сущность, и как собирательное для блоков, элементов и модификаторов.
ru_uk: Це поняття може застосовуватися як приватне, якщо розглядається окрема БЕМ-сутність, і як збірне для блоків, елементів і модифікаторів.

source: Микс
ru_uk: Мікс

source: Способ использования разных [БЭМ-сущностей](#БЭМ-сущность) на одном [DOM-узле](https://ru.wikipedia.org/wiki/Document_Object_Model).
ru_uk: Спосіб використання різних [БЕМ-сутностей](#БЕМ-сутність) на одному [DOM-вузлі](https://ru.wikipedia.org/wiki/Document_Object_Model).

source: Миксы позволяют:
ru_uk: Мікси дозволяють:

source: совмещать поведение и стили нескольких БЭМ-сущностей без дублирования кода;
ru_uk: поєднувати поведінку і стилі декількох БЕМ-сутностей без дублювання коду;

source: создавать семантически новые компоненты интерфейса на основе имеющихся БЭМ-сущностей.
ru_uk: створювати семантично нові компоненти інтерфейсу на основі наявних БЕМ-сутностей.

source: Рассмотрим пример микса блока и элемента другого блока.
ru_uk: Розглянемо приклад міксу блоку і елемента іншого блоку.

source: Допустим, в проекте ссылки реализованы блоком `link`.
ru_uk: Припустимо, у проекті посилання реалізовані блоком `link`.

source: Необходимо сделать ссылками пункты меню.
ru_uk: Необхідно зробити посиланнями на пункти меню.

source: Существует несколько способов:
ru_uk: Існує кілька способів:

source: Создать модификатор для пункта меню, который превратит пункт в ссылку.
ru_uk: Створити модифікатор для пункту меню, який перетворить пункт у посилання.

source: Но в таком случае для реализации модификатора придется скопировать поведение и стили блока `link`.
ru_uk: Але в такому випадку для реалізації модифікатора доведеться скопіювати поведінку і стилі блоку `link`.

source: Это приведет к дублированию кода.
ru_uk: Це призведе до дублювання коду.

source: Воспользоваться миксом универсального блока `link` и элемента `link` блока `menu`.
ru_uk: Скористатися міксом універсального блоку `link` і елемента `link` блоки `menu`.

source: Микс двух БЭМ-сущностей позволит применить базовую функциональность ссылок из блока `link` и дополнительные CSS-правила из блока `menu` без копирования кода.
ru_uk: Мікс двох БЕМ-сутностей дозволить застосувати базову функціональність посилань з блоку `link` і додаткові CSS-правила з блоку `menu` без копіювання коду.

source: БЭМ-дерево
ru_uk: БЕМ-дерево

source: Представление структуры веб-страницы в терминах блоков, элементов и модификаторов.
ru_uk: Представлення структури веб-сторінки в термінах блоків, елементів і модифікаторів.

source: Это абстракция над [DOM-деревом](https://ru.wikipedia.org/wiki/Document_Object_Model), которая описывает имена БЭМ-сущностей, их состояния, порядок, вложенность и вспомогательные данные.
ru_uk: Це абстракція над [DOM-деревом](https://ru.wikipedia.org/wiki/Document_Object_Model), яка описує імена БЕМ-сутностей, їх стану, порядок, структуру і допоміжні дані.

source: В реальных проектах БЭМ-дерево можно выразить любым форматом, который поддерживает древовидную структуру.
ru_uk: У реальних проектах БЕМ-дерево можна виразити будь-якому форматі, який підтримує деревоподібну структуру.

source: Рассмотрим пример DOM-дерева:
ru_uk: Розглянемо приклад DOM-дерева:

source: Ему соответствует такое БЭМ-дерево:
ru_uk: Йому відповідає такий БЕМ-дерево:

source: Это же БЭМ-дерево будет иметь следующий вид в форматах XML и [BEMJSON](https://ru.bem.info/technology/bemjson/):
ru_uk: Це ж БЕМ-дерево буде мати наступний вигляд у форматах XML і [BEMJSON](https://ru.bem.info/technology/bemjson/):

source: Реализация блока
ru_uk: Реалізація блоку

source: Набор различных [технологий](#Технология-реализации), определяющих следующие особенности БЭМ-сущности:
ru_uk: Набір різних [технологій](#Технологія-реалізації), що визначають такі особливості БЕМ-суті:

source: поведение;
ru_uk: поведінку;

source: внешний вид;
ru_uk: зовнішній вигляд;

source: тесты;
ru_uk: тести;

source: шаблоны;
ru_uk: шаблони;

source: документацию;
ru_uk: документацію;

source: описание зависимостей;
ru_uk: опис залежностей;

source: дополнительные данные (например, картинки).
ru_uk: додаткові дані (наприклад, картинки).

source: Технология реализации
ru_uk: Технологія реалізації

source: Технология, которая используется для [реализации](#Реализация-блока) блока.
ru_uk: Технологія, яка використовується для [реалізацію](#Реалізація-блоку) блоку.

source: Блоки могут быть реализованы в одной или нескольких технологиях, например:
ru_uk: Блоки можуть бути реалізовані в одній або декількох технологіях, наприклад:

source: поведение — JavaScript, CoffeeScript;
ru_uk: поведінка — JavaScript, CoffeeScript;

source: внешний вид — CSS, Stylus, Sass;
ru_uk: зовнішній вигляд — CSS, Stylus, Sass;

source: шаблоны — Jade, Handlebars, XSL, BEMHTML, BH;
ru_uk: шаблони — Jade, Handlebars, XSL, BEMHTML, BH;

source: документация — Markdown, Wiki, XML.
ru_uk: документація — Markdown, Wiki, XML.

source: Например, если внешний вид блока задан с помощью CSS, это означает, что блок реализован в технологии CSS.
ru_uk: Наприклад, якщо зовнішній вигляд блоку задано за допомогою CSS, це означає, що блок реалізований у технології CSS.

source: А если документация к блоку написана в формате Markdown — блок реализован в технологии Markdown.
ru_uk: А якщо документація до блоку написана у форматі Markdown — блок реалізований у технології Markdown.

source: Переопределение блока
ru_uk: Перевизначення блоку

source: Изменение [реализации](#Реализация-блока) блока путем добавления ему новых особенностей на другом [уровне](#Уровень-переопределения).
ru_uk: Зміна [реалізацію](#Реалізація-блоку) блоку шляхом додання йому нових особливостей на іншому [рівні](#Рівень-перевизначення).

source: Уровень переопределения
ru_uk: Рівень перевизначення

source: Набор БЭМ-сущностей и их частичных [реализаций](#Реализация-блока).
ru_uk: Набір БЕМ-сутностей і їх часткових [реалізацій](#Реалізація-блоку).

source: Конечная реализация блока может быть разделена по разным уровням переопределения.
ru_uk: Кінцева реалізація блоку може бути поділена за різними рівнями перевизначення.

source: Каждый последующий уровень добавляет или перекрывает исходную реализацию блока.
ru_uk: Кожен наступний рівень додає або перекриває вихідну реалізацію блоку.

source: Конечный результат собирается из отдельных [технологий реализации](#Технология-реализации) блока со всех уровней переопределения последовательно в заданном порядке.
ru_uk: Кінцевий результат збирається з окремих [технологій реалізації](#Технологія-реалізації) блоку з усіх рівнів перевизначення послідовно в заданому порядку.

source: [Переопределять](#Переопределение-блока) можно любые [технологии реализации](#Технология-реализации) БЭМ-сущностей.
ru_uk: [Ігнорувати](#Перевизначення-блоку) можна будь-які [технології реалізації](#Технологія-реалізації) БЕМ-сутностей.

source: Например, в проект на отдельный уровень подключается сторонняя библиотека, которая содержит готовые реализации блоков.
ru_uk: Наприклад, проект на окремий рівень підключається стороння бібліотека, яка містить готові реалізації блоків.

source: Проектные блоки хранятся на другом уровне переопределения.
ru_uk: Проектні блоки зберігаються на іншому рівні перевизначення.

source: Предположим, что необходимо изменить внешний вид одного из блоков библиотеки.
ru_uk: Припустимо, що необхідно змінити зовнішній вигляд одного з блоків бібліотеки.

source: Для этого не нужно менять CSS-правила блока в исходном коде библиотеки или копировать код на уровень проекта.
ru_uk: Для цього не потрібно змінювати CSS-правила блоку у вихідному коді бібліотеки або копіювати код на рівень проекту.

source: Достаточно создать дополнительные CSS-правила для этого блока на проектном уровне.
ru_uk: Досить створити додаткові CSS-правила для цього блоку на проектному рівні.

source: При сборке в конечную реализацию подключатся исходные стили с уровня библиотеки и новые — с уровня проекта.
ru_uk: При зборці в кінцеву реалізацію підключаться вихідні стилі з рівня бібліотеки та нові — з рівня проекту.
