Repository: OleksandraP/translation
Catalog: methodology/history/history.*.xlf
Languages: ru_uk

source: История создания БЭМ
ru_uk: Історія створення БЕМ

source: [Типичная верстка в Яндексе (2005)](#Типичная-верстка-в-Яндексе-2005-года)
ru_uk: [Типова верстка в Яндексі (2005)](#Типова-верстка-в-Яндексі-2005-року)

source: [Зарождение основ методологии (2006)](#Зарождение-основ-методологии)
ru_uk: [Зародження основ методології (2006)](#Зародження-основ-методології)

source: [Зачатки общепортального фреймворка (2006)](#Зачатки-общепортального-фреймворка)
ru_uk: [Зачатки общепортального фреймворку (2006)](#Зачатки-общепортального-фреймворку)

source: [Верстка независимыми блоками (2007)](#Верстка-независимыми-блоками)
ru_uk: [Верстка незалежними блоками (2007)](#Верстка-незалежними блоками)

source: Появление БЭМ (2009)](#Лего-20-Появление-БЭМ)
ru_uk: Поява БЕМ (2009)](#Лего-20-Поява-БЕМ)

source: [БЭМ и open source (2010)](#БЭМ-и-open-source-2010)
ru_uk: [БЕМ і open source (2010)](#БЕМ-і-open-source-2010)

source: Типичная верстка в Яндексе 2005 года
ru_uk: Типова верстка в Яндексі 2005 року

source: История БЭМ началась в 2005 году.
ru_uk: Історія БЕМ почалася в 2005 році.

source: Тогда, с точки зрения интерфейса, обычный проект Яндекса был набором статических HTML-страниц, которые использовались как основа для создания шаблонов на XSL.
ru_uk: Тоді, з точки зору інтерфейсу, звичайний проект Яндекса був набором статичних HTML-сторінок, які використовувалися як основа для створення шаблонів на XSL.

source: HTML-страницы хранились в отдельной директории, которая имела подобную структуру:
ru_uk: HTML-сторінки зберігалися в окремій директорії, яка мала таку структуру:

source: Для каждой страницы создавался отдельный HTML-файл.
ru_uk: Для кожної сторінки створювався окремий HTML-файл.

source: В верстке использовались `id` и `классы`.
ru_uk: У верстці використовувалися `id` і `класи`.

source: Скрипты хранились в одном файле для всего проекта — `project.js`.
ru_uk: Скрипти зберігалися в одному файлі для всього проекту — `project.js`.

source: JavaScript использовался как вспомогательный инструмент для оживления страницы, поэтому `project.js` был небольшим.
ru_uk: JavaScript використовувався як допоміжний інструмент для пожвавлення сторінки, тому `project.js` був невеликим.

source: Картинки складывались в отдельную директорию.
ru_uk: Картинки складалися в окрему директорію.

source: Необходимость поддержки IE 5 и отсутствие CSS3 в браузерах, вынуждало использовать картинки для реализации любого оформления, даже для закругленных уголков.
ru_uk: Необхідність підтримки IE 5 і відсутність CSS3 в браузерах, змушувало використовувати картинки для реалізації будь-якого оформлення, навіть для закруглених куточків.

source: Стили, как и скрипты, находились в одном файле — `project.css`.
ru_uk: Стилі, як і скрипти, перебували в одному файлі `project.css`.

source: Для отделения стилей разных частей страницы использовались комментарии с указанием начала и конца:
ru_uk: Для відділення стилів різних частин сторінки використовувалися коментарі з зазначенням початку та кінця:

source: Сверстанные статические HTML-страницы нарезались в XSL-шаблоны.
ru_uk: Зверстані статичні HTML-сторінки нарізалися в XSL-шаблони.

source: Если HTML изменялся, все правки было необходимо переносить вручную в XSL.
ru_uk: Якщо HTML змінювався, всі правки було необхідно переносити вручну в XSL.

source: И наоборот, изменения в шаблонах требовали правок в HTML (для поддержания статического HTML в актуальном состоянии).
ru_uk: І навпаки, зміни в шаблонах вимагали правок у HTML для підтримання статичного HTML в актуальному стані).

source: Зарождение основ методологии
ru_uk: Зародження основ методології

source: В 2006 году началась работа над первыми большими проектами - Яндекс.Музыка и Я.ру.
ru_uk: У 2006 році розпочалася робота над першими великими проектами - Яндекс.Музика і Я. ру.

source: Эти проекты с десятками страниц выявили основные недостатки текущего подхода к разработке:
ru_uk: Ці проекти з десятками сторінок виявили основні недоліки поточного підходу до розробки:

source: сложно подбирать названия классам;
ru_uk: складно підбирати назви класів;

source: невозможно внести изменения в код одной страницы, не затрагивая код другой.
ru_uk: неможливо внести зміни в код однієї сторінки, не зачіпаючи код інший.

source: Типичный CSS того времени, содержащий длинный каскад:
ru_uk: Типовий CSS того часу, містить довгий каскад:

source: Одновременное использование `id` и `тегов`:
ru_uk: Одночасне використання `id` і `тегів`:

source: Картинки на фоне (begin)
ru_uk: Картинки на тлі (begin)

source: Картинки на фоне (end)
ru_uk: Картинки на тлі (end)

source: Верстка большоего проекта была неуправляемой.
ru_uk: Верстка большоего проекту була некерованою.

source: Чтобы избежать этого, нужно было определить правила работы с понятиями `класса`, `тега`, `визуального компонента` и не только.
ru_uk: Щоб уникнути цього, потрібно було визначити правила роботи з поняттями `класу`, `tag`, `візуального компонента` і не тільки.

source: Появление блоков
ru_uk: Поява блоків

source: Основное время разработчиков тратилось на создание HTML-структуры страницы и написание CSS-стилей для нее.
ru_uk: Основний час розробників витрачалося на створення HTML-структури сторінки і написання CSS-стилі для неї.

source: JavaScript воспринимался лишь как сопутствующая технология.
ru_uk: JavaScript сприймався лише як супутня технологія.

source: Чтобы ускорить разработку, требовалось облегчить поддержку HTML и CSS отдельных компонентов страницы.
ru_uk: Щоб прискорити розробку, потрібно полегшити підтримку HTML і CSS окремих компонентів сторінки.

source: Для этого мы ввели новое понятие – `блок`.
ru_uk: Для цього ми ввели нове поняття – `блок`.

source: `Блоком` называлась часть дизайна страницы или раскладки со своим специфическим и уникальным значением, определенным семантически или визуально.
ru_uk: `Блоком` називалася частина дизайну сторінки або розкладки зі своїм специфічним і унікальним значенням, визначеним семантично або візуально.

source: В большинстве случаев любой компонент на странице (сложный или простой) рассматривался как блок.
ru_uk: У більшості випадків будь-який компонент на сторінці (складний або простий) розглядався як блок.

source: HTML-контейнер каждого блока получал уникальный CSS-класс с тем же именем, что и у блока.
ru_uk: HTML-контейнер кожного блоку отримував унікальний CSS-клас з тим же ім'ям, що і у блоку.

source: Классам блоков мы добавили префиксы (`b-`, `c-`, `g-`), чтобы отличать их от внутренних классов:
ru_uk: Класів блоків ми додали префікси (`b`, `c`, `g`), щоб відрізняти їх від внутрішніх класів:

source: Независимый блок, может использоваться в любом месте страницы.
ru_uk: Незалежний блок, може використовуватися в будь-якому місці сторінки.

source: Контрол (независимый блок), с которым ассоциирован JavaScript-объект, обеспечивающий его функциональность.
ru_uk: Контрол (незалежний блок), з яким асоційований JavaScript-об'єкт, що забезпечує його функціональність.

source: Может использоваться в любом месте страницы.
ru_uk: Може використовуватися в будь-якому місці сторінки.

source: Глобальное определение, используется по необходимости.
ru_uk: Глобальне визначення, використовується за необхідності.

source: Количество сведено к минимуму.
ru_uk: Кількість зведено до мінімуму.

source: Кроме префиксов использовались постфиксы:
ru_uk: Крім префіксів використовувалися постфиксы:

source: Стиль применяется в отсутствие JavaScript.
ru_uk: Стиль застосовується в відсутність JavaScript.

source: Если JavaScript включен, то при загрузке страницы вызывается метод `init()` в onload, и постфикс удаляется из всех классов.
ru_uk: Якщо JavaScript включений, то при завантаженні сторінки викликається метод `init()` в onload, і постфікс видаляється з усіх класів.

source: Так «включался» JavaScript для блоков.
ru_uk: Так «включався» JavaScript для блоків.

source: Появление элементов
ru_uk: Поява елементів

source: В HTML-контейнере, формирующем блок, некоторые узлы получали четкое имя CSS-класса.
ru_uk: У HTML-контейнері, що формує блок, деякі вузли одержували чітке ім'я CSS-класу.

source: Это не только облегчило создание стилистических правил, независящих от имени тега, но и позволяло присваивать семантически значимую роль каждому узлу.
ru_uk: Це не тільки полегшило створення стилістичних правил, незалежних від імені тега, але й дозволяло присвоювати семантично значущу роль кожного вузла.

source: Такие внутренние узлы мы назвали `элементами блока`, или просто `элементами`.
ru_uk: Такі внутрішні вузли ми назвали `елементами блоку`, або просто `елементами`.

source: Ключевое различие между блоком и элементом в тот момент:
ru_uk: Ключова відмінність між блоком і елементом в той момент:

source: элемент не может существовать вне контекста родительского блока;
ru_uk: елемент не може існувати поза контекстом батьківського блоку;

source: из блока нельзя извлечь ни один элемент.
ru_uk: з блоку не можна отримати ні один елемент.

source: Если элемент способен существовать вне блока, он становится блоком.
ru_uk: Якщо елемент здатний існувати поза блоку, він стає блоком.

source: Позже стало возможным вынимать некоторые элементы из блока, сохраняя при этом рабочее состояние самого блока.
ru_uk: Пізніше стало можливим виймати деякі елементи блоку, зберігаючи при цьому робочий стан самого блоку.

source: Элементы с большим количеством кода выделялись комментариями.
ru_uk: Елементи з великою кількістю коду виділялися коментарями.

source: Унификация файловой структуры проекта
ru_uk: Уніфікація файлової структури проекту

source: Разработчики интерфейсов обычно поддерживают несколько проектов одновременно.
ru_uk: Розробники інтерфейсів зазвичай підтримують декілька проектів одночасно.

source: Работать с разными проектами легче, если все они имеют одинаковую (или очень похожую) файловую структуру.
ru_uk: Працювати з різними проектами легше, якщо всі вони мають однакову (або дуже схожу) файлову структуру.

source: Поэтому мы унифицировали структуры репозиториев разных проектов.
ru_uk: Тому ми уніфікували структури репозиторіїв різних проектів.

source: Начали с того, что CSS, JavaScript и картинки стали складывать в отдельные директории.
ru_uk: Почали з того, що CSS, JavaScript і картинки стали складати в окремі директорії.

source: JavaScript применялся все чаще, в проект подключались дополнительные компоненты и библиотеки.
ru_uk: JavaScript застосовувався все частіше, в проект підключалися додаткові компоненти та бібліотеки.

source: Типичная структура верстки проекта 2006 года:
ru_uk: Типова структура верстки проекту 2006 року:

source: Основной код для IE мы писали в общем CSS-файле, наприемр, `yaru.css`.
ru_uk: Код основний для IE ми писали в загальному CSS-файлі, наприемр, `yaru.css`.

source: Специфичные правила (временные решения), работающие только в IE, создавались в отдельном файле.
ru_uk: Специфічні правила (тимчасові рішення), що працюють тільки в IE, створювалися в окремому файлі.

source: В имя файла доблялся специальный указатель `ie` — `yaru-ie.css`.
ru_uk: В ім'я файлу доблялся спеціальний покажчик `ie` — `yaru-ie.css`.

source: Зачатки общепортального фреймворка
ru_uk: Зачатки общепортального фреймворку

source: При верстке нескольких проектов с похожим дизайном появлялись общие блоки.
ru_uk: При верстці декількох проектів зі схожим дизайном з'являлися загальні блоки.

source: Портал Яндекса в то время содержал больше 100 разных сервисов, выполненных в одном стиле.
ru_uk: Портал Яндекса в той час містив більше 100 різних сервісів, виконаних в одному стилі.

source: Для такого объема данных «copy/paste» из проекта в проект уже не подходил.
ru_uk: Для такого обсягу даних «copy/paste» з проекту у проект вже не підходив.

source: Появилось общее хранилище повторно используемых компонентов, которое называлось `общая библиотека блоков` или просто — `Common`.
ru_uk: З'явилося загальне сховище повторно використовуваних компонентів, яке називалося `загальна бібліотека блоків` або просто " `Common`.

source: Первые блоки, которые вошли в `Common`: шапка, подвал и стили для статического текста.
ru_uk: Перші блоки, які увійшли в `Common`: шапка, підвал і стилі для статичного тексту.

source: Файлы блоков хранились на выделенном внутреннем сервере разработчиков (**common.cloudkill.yandex.ru** в примере ниже).
ru_uk: Файли блоків зберігалися на виділеному внутрішньому сервері розробників (**common.cloudkill.yandex.ru** у наведеному нижче прикладі).

source: Это было началом работы нашего общепортального фреймворка.
ru_uk: Це було початком роботи нашого общепортального фреймворка.

source: Cтили из него подключались в основной проектный файл при помощи импортов непосредственно с сервера:
ru_uk: Стилі з нього підключалися в основний проектний файл за допомогою импортов безпосередньо з сервера:

source: @import url(http://common.cloudkill.yandex.ru/css/global.css); @import url(http://common.cloudkill.yandex.ru/css/head/common.css); @import url(http://common.cloudkill.yandex.ru/css/static-text.css); @import url(http://common.cloudkill.yandex.ru/css/list/hlist.css); @import url(http://common.cloudkill.yandex.ru/css/list/hlist-middot.css); @import url(slider.css); /* Header (begin) */ /* Service (begin) */ .b-head .service h1 { … } .b-head .service h1, .b-head .service h1 a, .b-head .service h1 b { … }
ru_uk: @import url(http://common.cloudkill.yandex.ru/css/global.css); @import url(http://common.cloudkill.yandex.ru/css/head/common.css); @import url(http://common.cloudkill.yandex.ru/css/static-text.css); @import url(http://common.cloudkill.yandex.ru/css/list/hlist.css); @import url(http://common.cloudkill.yandex.ru/css/list/hlist-middot.css); @import url(slider.css); /* Header (begin) */ /* Service (begin) */ .b-head .service h1 { ... } .b-head .service h1, .b-head .service a h1, .b-head .service h1 b { ... }

source: Возникла проблема: большое количество импортов замедляло загрузку страницы.
ru_uk: Виникла проблема: велика кількість импортов уповільнювало завантаження сторінки.

source: Было принято решение прекомпилировать стили (и позже JavaScript-файлы) перед выкладкой.
ru_uk: Було прийнято рішення прекомпилировать стилі (і пізніше JavaScript-файли) перед викладкою.

source: Компиляция заменяет `@import` на содержимое внешних файлов (это называется `inlining`) и оптимизирует код: например, убирает ненужные браузеру пробелы и комментарии.
ru_uk: Компіляція замінює `@import` на вміст зовнішніх файлів (це називається `inlining`) і оптимізує код: наприклад, прибирає непотрібні браузеру прогалини і коментарі.

source: Наш внутренний инструмент для оптимизации вырос из простого Perl-скрипта в отдельный open-source-проект [borschik](https://ru.bem.info/tools/optimizers/borschik/).
ru_uk: Наш внутрішній інструмент для оптимізації виріс з простого Perl-скрипта в окремий open-source-проект [borschik](https://ru.bem.info/tools/optimizers/borschik/).

source: Верстка независимыми блоками
ru_uk: Верстка незалежними блоками

source: К осени 2007 года правила верстки устоялись.
ru_uk: До осені 2007 року правила верстки устоялися.

source: Мы увидели практическую пользу от нового подхода, поэтому было решено рассказать об этом вне Яндекса.
ru_uk: Ми побачили практичну користь від нового підходу, тому було вирішено розповісти про це поза Яндекса.

source: На ClientSide'07 был сделан доклад про [верстку независимыми блоками](http://vitaly.harisov.name/article/independent-blocks.html), которая на тот момент составляла основу наших HTML-страниц.
ru_uk: На ClientSide'07 було зроблено доповідь про [верстку незалежними блоками](http://vitaly.harisov.name/article/independent-blocks.html), яка на той момент становила основу наших HTML-сторінок.

source: В докладе официально вводилось понятие `блок`:
ru_uk: У доповіді офіційно вводилося поняття `блок`:

source: <blockquote>Блоком будем называть фрагмент страницы, который описывается своей разметкой и стилями.</blockquote>
ru_uk: <blockquote>Блоком будемо називати фрагмент сторінки, який описується своєю розміткою і стилями.</blockquote>

source: Более позднее [описание](https://ru.bem.info/forum/-45/).
ru_uk: Більш пізніше [опис](https://ru.bem.info/forum/-45/).

source: Блоки делились на простые и составные.
ru_uk: Блоки поділялися на прості і складові.

source: <blockquote>В простые блоки нельзя вкладывать другие блоки, в составные — можно.</blockquote>
ru_uk: <blockquote>прості блоки не можна вкладати інші блоки, складові — можна.</blockquote>

source: Это было очень наивное деление: мы неоднократно сталкивались с тем, что даже в самые простые блоки вкладывались другие, и приходилось переделывать верстку.
ru_uk: Це було дуже наївне поділ: ми неодноразово стикалися з тим, що навіть у найпростіші блоки вкладалися інші, і доводилося переробляти верстку.

source: В итоге мы пришли к противоположному принципу:
ru_uk: У результаті ми прийшли до протилежного принципом:

source: <blockquote>Любой блок должен позволять вкладывать в него другой блок, когда это возможно.</blockquote>
ru_uk: <blockquote>Будь блок повинен дозволяти вкладати в нього інший блок, коли це можливо.</blockquote>

source: Правила независимости блоков
ru_uk: Правила незалежності блоків

source: Сформировались первые правила независимости блока:
ru_uk: Сформувалися перші правила незалежності блоку:

source: Для описания элемента используется `class`, но не `id`.
ru_uk: Для опису елемента використовується `class`, а не `id`.

source: Каждый блок имеет префикс.
ru_uk: Кожен блок має префікс.

source: В таблице стилей нет классов вне блоков.
ru_uk: В таблиці стилів немає класів поза блоків.

source: Важным решением был отказ от `id`.
ru_uk: Важливим рішенням було відмову від `id`.

source: Теперь мы могли:
ru_uk: Тепер ми могли:

source: отображать на странице один и тот же блок несколько раз;
ru_uk: відображати на сторінці один і той же блок кілька разів;

source: использовать на одном DOM-узле несколько классов (что нам пригодилось в дальнейшем).
ru_uk: використовувати на одному DOM-сайті кілька класів (що нам в нагоді надалі).

source: Правила полной независимости блоков
ru_uk: Правила повної незалежності блоків

source: С текущей схемой оставался ряд проблем с CSS:
ru_uk: З поточною схемою залишався ряд проблем з CSS:

source: CSS мог работать неправильно, если на одной странице смешиваются стили из разных источников.
ru_uk: CSS міг працювати неправильно, якщо на одній сторінці змішуються стилі з різних джерел.

source: В сложных случаях блоки могли вредить отображению друг друга из-за конфликта имен элементов.
ru_uk: У складних випадках блоки могли шкодити відображення один одного з-за конфлікту імен елементів.

source: Стили, опирающиеся на имена тегов, могли охватывать больше элементов, чем было задумано.
ru_uk: Стилі, що спираються на імена тегів, могли охоплювати більше елементів, ніж було задумано.

source: Поэтому мы сформулировали правила более строгой независимости блоков под названием [абсолютно независимые блоки](https://ru.bem.info/forum/-46/) (АНБ):
ru_uk: Тому ми сформулювали правила більш суворої незалежності блоків під назвою [абсолютно незалежні блоки](https://ru.bem.info/forum/-46/) (АНБ):

source: Никогда не опираться на элементы - только на классы.
ru_uk: Ніколи не спиратися на елементи - лише на класи.

source: Всем классам внутри блока давать имена, начинающиеся с имени этого блока.
ru_uk: Всім класами всередині блоку давати імена, що починаються з імені цього блоку.

source: Мы понимали, что наличие класса у каждого DOM-узла существенно увеличивает объем HTML-кода.
ru_uk: Ми розуміли, що наявність класу в кожного DOM-сайту суттєво збільшує обсяг HTML-коду.

source: На тот момент мы считали, что это дорого, и применяли такой подход в исключительных случаях.
ru_uk: На той момент ми вважали, що це дорого, і застосовували такий підхід у виняткових випадках.

source: Первые правила именования — префиксы
ru_uk: Перші правила іменування — префікси

source: Так как распространенной проблемой в программировании является подбор имен переменным.
ru_uk: Так як поширеною проблемою у програмуванні є підбір імен змінних.

source: Мы решили задавать имена блоков с помощью разных префиксов с разной семантикой:
ru_uk: Ми вирішили задавати імена блоків з допомогою різних префіксів з різною семантикою:

source: **b-** — обычные блоки;
ru_uk: **b-** — звичайні блоки;

source: **h-** — обертки для нескольких блоков;
ru_uk: **h-** — обгортки для декількох блоків;

source: **l-** — раскладки;
ru_uk: **l-** — розкладки;

source: **g-** — глобальные стили.
ru_uk: **g-** — глобальні стилі.

source: Появление модификации блоков
ru_uk: Поява модифікації блоків

source: Работая с блоками, мы поняли, что они могут иметь разные состояния.
ru_uk: Працюючи з блоками, ми зрозуміли, що вони можуть мати різні стани.

source: Например, блок `Кнопка` может быть представлен в трех состояниях: маленькая, нормальная и большая.
ru_uk: Наприклад, блок `Кнопка` може бути представлений в трьох станах: маленька, нормальна і велика.

source: Вместо того, чтобы создавать три разных блока, мы начали делать `модификации` одного.
ru_uk: Замість того, щоб створювати три різних блоку, ми почали робити `модифікації` одного.

source: `Модификацию` мы определили как особое состояние блока или как метку, несущую определенное свойство блоку.
ru_uk: `Модифікацію` ми визначили як особливий стан блоку або як мітку, що несе певну властивість блоку.

source: Модификация состояла из имени (например, `size`) и значения (например, `small`, `normal` или `big`).
ru_uk: Модифікація складалася з імені (наприклад, `size`) і значення (наприклад, `small`, `normal` або `big`).

source: Возможные варианты модификации:
ru_uk: Можливі варіанти модифікації:

source: Блок может изменить свой внешний вид в зависимости от того, где он находится.
ru_uk: Блок може змінити свій зовнішній вигляд в залежності від того, де він знаходиться.

source: Это модификация от контекста.
ru_uk: Це модифікація від контексту.

source: Можно добавить блоку второй класс.
ru_uk: Можна додати блоку другий клас.

source: Это модификация постфиксом, она не зависит от контекста.
ru_uk: Це модифікація постфиксом, вона не залежить від контексту.

source: Весной 2008 года была поставлена задача создать брендбук, описывающий наш портальный стиль.
ru_uk: Навесні 2008 року було поставлено завдання створити брендбук, що описує наш портальний стиль.

source: Решили начать работу с написания HTML/CSS кода.
ru_uk: Вирішили почати роботу з написання HTML/CSS коду.

source: Проект получил название `Лего`.
ru_uk: Проект отримав назву `Лего`.

source: Структура репозитория
ru_uk: Структура репозиторію

source: На верхнем уровне репозиторий разделен по технологиям:
ru_uk: На верхньому рівні репозиторій розділений за технологіями:

source: Директория каждой технологии имеет свою структуру.
ru_uk: Директорія кожної технології має свою структуру.

source: CSS распределяется на следующие директории:
ru_uk: CSS розподіляється на наступні директорії:

source: `util` — блоки, которые имеют смысл вне Яндекса, их можно выложить в open source;
ru_uk: `util` — блоки, які мають сенс поза Яндекса, їх можна викласти в open source;

source: `service` — стили для конкретных сервисов Яндекса.
ru_uk: `service` — стилі для конкретних сервісів Яндекса.

source: Подключив их к сервису, можно отобразить шапку или подвал.
ru_uk: Підключивши їх до сервісу, можна відобразити шапку або підвал.

source: Структура директории HTML аналогична CSS:
ru_uk: Структура директорії HTML аналогічна CSS:

source: JS находится в зачаточном состоянии и складывается в одну директорию:
ru_uk: JS знаходиться в зародковому стані і складається в одну директорію:

source: У каждого сервиса есть XML-файл, использующийся для построения шапки:
ru_uk: У кожного сервісу є XML-файл, що використовується для побудови шапки:

source: XSL блоков находится в одной директории.
ru_uk: XSL блоків знаходиться в одній директорії.
