Repository: OleksandraP/translation
Catalog: methodology/history/history.*.xlf
Languages: ru_uk

source: Каждому блоку соответствует один файл:
ru_uk: Кожному блоку відповідає один файл:

source: `Лего` подключается в проекты с помощью *svn:externals*.
ru_uk: `Лего` підключається в проекти з допомогою *svn:externals*.

source: При финальной сборке проекта код библиотеки полностью включается в проект, что можно сравнить со статической линковкой.
ru_uk: При фінальної складанні проекту код бібліотеки повністю включається в проект, що можна порівняти зі статичною линковкой.

source: Такой подход позволяет выпускать версии сервисов с разными версиями `Лего` и переходить на новую версию тогда, когда это удобно команде проекта.
ru_uk: Такий підхід дозволяє випускати версії сервісів з різними версіями `Лего` і переходити на нову версію тоді, коли це зручно команді проекту.

source: Файлы страниц
ru_uk: Файли сторінок

source: Файлы, подключавшиеся на страницах, состояли из `@import`'ов реализации блоков.
ru_uk: Файли, подключавшиеся на сторінках, складалися з `@import`ов реалізації блоків.

source: Эти `@import`'ы писались вручную.
ru_uk: Ці `@import`и писалися вручну.

source: Правила именования
ru_uk: Правила іменування

source: Именование файлов еще не устоялось - мы пробуем разные варианты.
ru_uk: Іменування файлів ще не устоялося - ми пробуємо різні варіанти.

source: Структура репозитория
ru_uk: Структура репозиторію

source: В рамках версии Лего `1.2`, был произведен рефакторинг, и структура репозитория проекта изменилась.
ru_uk: В рамках версії Лего `1.2`, був проведений рефакторинг, і структура репозиторію проекту змінилася.

source: Убрано разделение на `util` и `block`, общий CSS находится в `common/css`.
ru_uk: Прибрано поділ на `util` і `block`, загальний CSS знаходиться в `common/css`.

source: От идеи выноса кода в open source на тот момент отказались и вернулись к ней только через два года.
ru_uk: Від ідеї винесення коду в open source на той момент відмовилися і повернулися до неї лише через два роки.

source: Всё, что находилось в опциональном CSS (файлах `b-dropdown_arr.css`), вынесено в директории (`arr/b-dropdown.arr.css`).
ru_uk: Все, що знаходилося в опціональному CSS (файлах `b-dropdown_arr.css`), винесено в директорії (`arr/b-dropdown.arr.css`).

source: В основном файле блока стало меньше кода.
ru_uk: В основному файлі блоку стало менше коду.

source: Правила именования
ru_uk: Правила іменування

source: Файлы для IE переименованы: указатель специфичности файла для IE был частью имени файла, а стал суффиксом.
ru_uk: Файли для IE перейменовані: покажчик специфічності файлу для IE був частиною імені файлу, а став суфіксом.

source: Было `-ie.css`, - стало `.ie.css`.
ru_uk: Було `-ie.css`, - стало `.ie.css`.

source: Расширения файлов теперь могут состоять из нескольких слов.
ru_uk: Розширення файлів тепер можуть складатися з кількох слів.

source: Для модификации постфиксом вместо дефиса начали использовать подчеркивание.
ru_uk: Для модифікації постфиксом замість дефіса почали використовувати підкреслення.

source: Это позволило визуально отделить имя блока от имени модификатора, что позже пригодилось при реализации инструментов, упрощающих работу с кодом.
ru_uk: Це дозволило візуально відокремити ім'я блоку від імені модифікатора, що пізніше стало в нагоді при реалізації інструментів, що спрощують роботу з кодом.

source: Появление БЭМ
ru_uk: Поява БЕМ

source: В марте 2009 года вышла версия `Лего 2.0`.
ru_uk: У березні 2009 року вийшла версія `Лего 2.0`.

source: Этим событием оканчивается `верстка независимыми блоками` и начинается `БЭМ`.
ru_uk: Цією подією закінчується `верстка незалежними блоками` і починається `БЕМ`.

source: **БЭМ** — аббревиатура от Блок-Элемент-Модификатор.
ru_uk: **БЕМ** — абревіатура від Блок-Елемент-Модифікатор.

source: Это три ключевых сущности, которые мы используем при разработке веб-компонентов.
ru_uk: Це три ключові сутності, які ми використовуємо при розробці веб-компонентів.

source: Что же принципиально изменилось с выходом версии 2.0?
ru_uk: Що ж принципово змінилося з виходом версії 2.0?

source: Основное изменение — мы вывели вперед блоки, а не технологии.
ru_uk: Основна зміна — ми вивели вперед блоки, а не технології.

source: Отныне блоки первичны, а технологии их реализации — вторичны.
ru_uk: Відтепер блоки первинні, а технології їх реалізації — вторинні.

source: Реализацию каждого блока разместили в отдельной директории, технологии — это файлы внутри нее.
ru_uk: Реалізацію кожного блоку розмістили в окремій директорії, технології — це файли всередині неї.

source: Также появилась документация к блоку — файл `.wiki` внутри блока.
ru_uk: Також з'явилася документація до блоку — файл `.wiki` всередині блоку.

source: Независимый блок
ru_uk: Незалежний блок

source: Может быть использован в любом месте страницы.
ru_uk: Може бути використаний в будь-якому місці сторінки.

source: В XML блок представлен тегом в неймспейсе `lego`:
ru_uk: У XML блок представлений тегом в неймспейсе `lego`:

source: HTML-класс блока соответствует имени этого тега:
ru_uk: HTML-клас блоку відповідає імені цього тега:

source: CSS-правила пишутся на класс:
ru_uk: CSS-правила пишуться на клас:

source: Все файлы (css, js, html, xsl), относящиеся к блоку, хранятся в его директории:
ru_uk: Всі файли (css, js, html, xsl), що належать до блоку, зберігаються в його директорії:

source: Элемент
ru_uk: Елемент

source: Составная часть блока, которая не может использоваться в отрыве от него.
ru_uk: Складова частина блоку, яка не може використовуватися у відриві від нього.

source: В XML элемент представлен в неймспейсе `lego` без префикса:
ru_uk: У XML елемент представлений в неймспейсе `lego` без префікса:

source: Класс в HTML соответствует имени этого тега без префикса.
ru_uk: Клас в HTML відповідає імені цього тега без префікса.

source: Файлы элемента хранятся в отдельной директории.
ru_uk: Файли елемента зберігаються в окремій директорії.

source: Имена файлов элементов пишутся через точку: `b-head-logo.name.css`
ru_uk: Імена файлів елементів пишуться через точку: `b-head-logo.name.css`

source: Модификатор
ru_uk: Модифікатор

source: Определяет внешний вид, состояние и реже поведение блока.
ru_uk: Визначає зовнішній вигляд, стан і рідше поведінка блоку.

source: В XML модификатор представлен атрибутом в неймспейсе `lego`:
ru_uk: У XML модифікатор представлений атрибутом в неймспейсе `lego`:

source: В HTML используется дополнительный класс:
ru_uk: В HTML використовується додатковий клас:

source: Файлы для модификатора находятся в отдельной директории.
ru_uk: Файли для модифікатора знаходяться в окремій директорії.

source: Имя директории модификатора начинается с подчеркивания:
ru_uk: Ім'я директорії модифікатора починається з підкреслення:

source: Декларация используемых блоков
ru_uk: Декларація використовуваних блоків

source: Все Лего-компоненты проекта описываются в XML-файле.
ru_uk: Всі Лего-компоненти проекту описуються в XML-файлі.

source: Из него генерируются CSS-файлы.
ru_uk: З нього генеруються CSS-файли.

source: На примере этого файла видно, что сначала указывается общий код, а потом добавляются стили, чтобы привести Лего-блоки к дизайну проекта.
ru_uk: На прикладі цього файлу видно, що спочатку вказується загальний код, а потім додаються стилі, щоб привести Лего-блоки до дизайну проекту.

source: Из XML-декларации генерируются и JS-файлы.
ru_uk: З XML-декларації генеруються і JS-файли.

source: А также XSL-файлы.
ru_uk: А також XSL-файли.

source: Мы перестали писать эти файлы руками, началась генерация кода.
ru_uk: Ми перестали писати ці файли руками, почалася генерація коду.

source: Скорость селекторов (2009)
ru_uk: Швидкість селекторів (2009)

source: При реализации новой версии Яндекс.Почты была поставлена задача сделать ее быстрой.
ru_uk: При реалізації нової версії Яндекс.Пошти було поставлено завдання зробити її швидко.

source: Для решения задачи мы начали использовать XSL в браузере (и подгружать XML, необходимый для отрисовки данных на странице).
ru_uk: Для вирішення завдання ми почали використовувати XSL в браузері (і довантажувати XML, необхідний для відтворення даних на сторінці).

source: Возникла проблема: трансформации отрабатывались быстро, но вставка в DOM полученного результата происходила очень медленно.
ru_uk: Виникла проблема: трансформації відпрацьовувалися швидко, але вставка в DOM отриманого результату відбувалася дуже повільно.

source: При этом, отключение CSS решало проблему.
ru_uk: При цьому, відключення CSS вирішувало проблему.

source: Выяснилось, что работу замедляют селекторы CSS, которые при большом DOM-дереве и большой таблице стилей оказывают существенное влияние на скорость отрисовки браузером страницы.
ru_uk: З'ясувалося, що уповільнюють роботу селектори CSS, які при великому DOM-дереві і великий таблиці стилів надають істотний вплив на швидкість відтворення браузером сторінки.

source: Результаты исследования подробно описаны в [статье](https://ru.bem.info/forum/-55/).
ru_uk: Результати дослідження докладно описані в [статті](https://ru.bem.info/forum/-55/).

source: Решение проблемы было уже готово — это [абсолютно независимые блоки (АНБ)](https://ru.bem.info/forum/-46/).
ru_uk: Рішення проблеми було вже готове — це [абсолютно незалежні блоки (АНБ)](https://ru.bem.info/forum/-46/).

source: Мы перевели все блоки в `Лего` на АНБ-нотацию и с тех пор создаем их так, чтобы у каждого DOM-узла был свой `class`, на который можно написать стили.
ru_uk: Ми перевели всі блоки в `Лего` на АНБ-позначення і з тих пір створюємо їх так, щоб у кожного DOM-сайту був свій `class`, на який можна написати стилі.

source: Также мы не используем Tag Rules в CSS.
ru_uk: Також ми не використовуємо Tag Rules в CSS.

source: В классы элементов вносится имя блока, селекторы получаются простыми и быстрыми.
ru_uk: В класи елементів вноситься ім'я блоку, селектори виходять простими і швидкими.

source: Стабилизация нотации
ru_uk: Стабілізація нотації

source: Постепенно мы пришли к тому, что нотация в коде и структура на файловой системе устоялись и уже не меняются.
ru_uk: Поступово ми прийшли до того, що нотація в коді і структура на файловій системі устоялися і вже не змінюються.

source: В именах файлов разделитель `.` был заменен на `__`.
ru_uk: В іменах файлів роздільник `.` був замінений на `__`.

source: Было `b-block.elem.css` — стало `b-block__elem.css`.
ru_uk: Було `b-block.elem.css` — стало `b-block__elem.css`.

source: Теперь они совпадают с CSS-селекторами.
ru_uk: Тепер вони збігаються з CSS-селекторами.

source: Были реализованы модификаторы у элементов по аналогии с модификаторами блоков: `.b-block__elem_theme_green` по аналогии с `.b-block_theme_green`.
ru_uk: Були реалізовані модифікатори у елементів за аналогією з модифікаторами блоків: `.b-block__elem_theme_green` за аналогією з `.b-block_theme_green`.

source: В имя файла модификатора и в его класс внесен тип модификатора.
ru_uk: В ім'я файлу модифікатора і в його клас внесений тип модифікатора.

source: Было `.b-menu__item_current` — стало `.b-menu__item_state_current`.
ru_uk: Було `.b-menu__item_current` — стало `.b-menu__item_state_current`.

source: Причина этого изменения — работа с модификаторами из JavaScript.
ru_uk: Причина цієї зміни — робота з модифікаторами з JavaScript.

source: БЭМ и open source (2010)
ru_uk: БЕМ і open source (2010)

source: В 2010 году мы снова вернулись к идее open source.
ru_uk: У 2010 році ми знову повернулися до ідеї open source.

source: Мы создали организацию [bem](https://github.com/bem) на GitHub.
ru_uk: Ми створили організацію [bem](https://github.com/bem) на GitHub.

source: Библиотека bem-bl
ru_uk: Бібліотека bem-bl

source: Мы начали выносить блоки из `Лего` в [bem-bl](https://ru.bem.info/libs/bem-bl/), проводя одновременно с этим рефакторинг.
ru_uk: Ми почали виносити блоки з `Лего " [bem-bl](https://ru.bem.info/libs/bem-bl/), проводячи одночасно з цим рефакторинг.

source: Параллельно с переносом блоков в новую библиотеку публиковали информацию про них.
ru_uk: Паралельно з перенесенням блоків в нову бібліотеку публікували інформацію про них.

source: Инструменты
ru_uk: Інструменти

source: Для работы с файлами по БЭМ-методам нам понадобились свои инструменты.
ru_uk: Для роботи з файлами за БЕМ-методів нам знадобилися свої інструменти.

source: Началась реализация инструментов [bem-tools](https://ru.bem.info/tools/bem/bem-tools/) на JavaScript под Node.js.
ru_uk: Почалася реалізація інструментів [bem-tools](https://ru.bem.info/tools/bem/bem-tools/) на JavaScript під Node.js.

source: Возникло новое понятие — `уровень переопределения`.
ru_uk: Виникло нове поняття — `рівень перевизначення`.

source: Так мы стали называть директории с реализацией блоков.
ru_uk: Так ми стали називати директорії з реалізацією блоків.

source: Например, в проекте может быть:
ru_uk: Наприклад, у проекті може бути:

source: Публичная библиотека блоков с GitHub;
ru_uk: Публічна бібліотека блоків з GitHub;

source: Внутренняя библиотека lego;
ru_uk: Внутрішня бібліотека lego;

source: Блоки самого проекта.
ru_uk: Блоки самого проекту.

source: На уровне переопределения можно задать другую схему именования директорий/файлов, отличную от нашей.
ru_uk: На рівні перевизначення можна задати іншу схему іменування папок/файлів, відмінну від нашої.

source: Для этого нужно указать новый уровень в конфигурации:
ru_uk: Для цього потрібно вказати новий рівень у конфігурації:

source: Например, вы можете задать другие разделители между именем блока и элемента, или не раскладывать все по директориям, а использовать плоскую структуру файлов.
ru_uk: Наприклад, ви можете задати інші роздільник між ім'ям блоку і елемента, або не розкладати все по директоріях, а використовувати плоску структуру файлів.

source: После экспериментов с разными шаблонизаторами, был разработан шаблонизатор [BEMHTML](https://ru.bem.info/technology/bemhtml/current/intro/), который позволяет:
ru_uk: Після експериментів з різними шаблонізатором, був розроблений шаблонизатор [BEMHTML](https://ru.bem.info/technology/bemhtml/current/intro/), який дозволяє:

source: писать шаблоны в БЭМ-терминах;
ru_uk: писати шаблони у БЕМ-термінах;

source: доопределять их на [уровнях переопределения](../key-concepts/key-concepts.ru.md#Уровень-переопределения);
ru_uk: доопределять їх на [рівнях перевизначення](../key-concepts/key-concepts.ru.md#Рівень-перевизначення);

source: исполнять эти шаблоны как на сервере, так и в браузере, поскольку
ru_uk: виконувати ці шаблони як на сервері, так і в браузері, оскільки

source: шаблоны компилируются в простой и быстрый JavaScript.
ru_uk: шаблони компілюються в простий і швидкий JavaScript.

source: Видео по BEMHTML:
ru_uk: Відео з BEMHTML:

source: Появлению БЭМ в том виде, что мы имеем сейчас, предшествовал долгий период проб и экспериментов.
ru_uk: Появі БЕМ у тому вигляді, що ми маємо зараз, передував довгий період проб і експериментів.

source: Хочется обратить ваше внимание, что на всех этапах своего развития это всё же был БЭМ.
ru_uk: Хочеться звернути вашу увагу, що на всіх етапах свого розвитку це все ж був БЕМ.

source: Тот БЭМ, что мы используем сейчас, — не единственное верное решение.
ru_uk: Той БЕМ, що ми використовуємо зараз, — не єдине вірне рішення.

source: Мы рекомендуем использовать БЭМ в ваших проектах в том объеме, в котором он принесет наибольшую пользу.
ru_uk: Ми рекомендуємо використовувати БЕМ у ваших проектах в тому обсязі, в якому він принесе найбільшу користь.

source: Можно пробовать применять его только для верстки.
ru_uk: Можна пробувати застосовувати його тільки для верстки.

source: Мы сами начинали именно с этого.
ru_uk: Ми самі починали саме з цього.

source: Гибкость БЭМ-методологии позволяет настраивать ее под свои текущие процессы и организовывать работу над проектом.
ru_uk: Гнучкість БЕМ-методології дозволяє налаштувати її під свої поточні процеси та організовувати роботу над проектом.

source: Главное понять, какие плюсы БЭМ принесет в ваш проект, выбрать подходящую для вас схему и начать применять у себя!
ru_uk: Головне зрозуміти, які плюси БЕМ принесе у ваш проект, вибрати підходящу для вас схему і почати застосовувати у себе!

source: Если у вас возникнут вопросы, обязательно задавайте их на нашем [форуме](https://ru.bem.info/forum/).
ru_uk: Якщо у вас виникнуть питання, обов'язково задавайте їх на нашому [форумі](https://ru.bem.info/forum/).
