Repository: OleksandraP/translation
Catalog: methodology/declarations/declarations.*.xlf
Languages: ru_uk

source: Декларации в БЭМ
ru_uk: Декларації в БЕМ

source: Чтобы перечислить БЭМ-сущности, необходимые для построения веб-страницы (читай «частного случая [бандла](../build/build.ru.md#bundle)»), можно воспользоваться **декларацией**.
ru_uk: Щоб перерахувати БЕМ-суті, необхідні для побудови веб-сторінки (читай «приватного випадку [бандла](../build/build.ru.md#bundle)»), можна скористатися **декларацією**.

source: Декларация представляет собой список [блоков](../key-concepts/key-concepts.ru.md#Блок), [элементов](../key-concepts/key-concepts.ru.md#Элемент) и [модификаторов](../key-concepts/key-concepts.ru.md#Модификатор), которые используются на странице.
ru_uk: Декларація являє собою список [блоків](../key-concepts/key-concepts.ru.md#Блок), [елементів](../key-concepts/key-concepts.ru.md#Елемент) і [модифікаторів](../key-concepts/key-concepts.ru.md#Модифікатор), які використовуються на сторінці.

source: Таким образом, инструмент сборки, основываясь на данных из декларации, ограничивает количество сущностей, попадающих в готовый проект.
ru_uk: Таким чином, інструмент збірки, грунтуючись на даних з декларації, обмежує кількість сутностей, що потрапляють в готовий проект.

source: Нет необходимости подключать все блоки проекта, если можно собрать только нужные по списку.
ru_uk: Немає необхідності підключати всі блоки проекту, якщо можна зібрати тільки потрібні за списком.

source: **Задача декларации** — определить, что и в каком порядке подключать в сборку.
ru_uk: **Завдання декларації** — визначити, що і в якому порядку підключати в збірку.

source: В БЭМ-платформе описание страницы создается в формате BEMJSON, а декларация страницы описывается в формате BEMDECL, например:
ru_uk: У БЕМ-платформі опис сторінки створюється у форматі BEMJSON, а декларація сторінки описується в форматі BEMDECL, наприклад:

source: Способы получения декларации
ru_uk: Способи одержання декларації

source: Декларация может формироваться вручную.
ru_uk: Декларація може формуватися вручну.

source: Для этого нужно перечислить БЭМ-сущности, участвующие в построении страницы.
ru_uk: Для цього потрібно перерахувати БЕМ-сутності, що беруть участь в побудові сторінки.

source: Автоматическое построение декларации возможно:
ru_uk: Автоматична побудова декларації можливо:

source: [по описанию страницы](#Создание-декларации-по-описанию-страницы)
ru_uk: [по опису сторінки](#Створення декларації-опису сторінки)

source: [с помощью интроспекции файловой системы](#Создание-декларации-с-помощью-интроспекции-файловой-системы)
ru_uk: [з допомогою інтроспекції файлової системи](#Створення декларації з допомогою інтроспекції-файлової системи)

source: Создание декларации по описанию страницы
ru_uk: Створення декларації за описом сторінки

source: Список необходимых для сборки сущностей можно получить по классам из HTML-файла веб-страницы.
ru_uk: Список необхідних для складання сутностей можна отримати за класами з HTML-файлу веб-сторінки.

source: В БЭМ-проекте структура веб-страницы описывается с помощью [БЭМ-дерева](../key-concepts/key-concepts.ru.md#БЭМ-дерево).
ru_uk: У БЕМ-проекті структура веб-сторінки описується з допомогою [БЕМ-дерева](../key-concepts/key-concepts.ru.md#БЕМ-дерево).

source: HTML-код страницы содержит классы с именами всех используемых блоков, элементов и модификаторов.
ru_uk: HTML-код сторінки містить класи з іменами всіх використовуваних блоків, елементів і модифікаторів.

source: БЭМ-дерево может быть построено автоматически по классам из HTML или создано вручную.
ru_uk: БЕМ-дерево може бути побудовано автоматично по класах з HTML або створено вручну.

source: При сборке страницы декларация формируется автоматически на основании данных из БЭМ-дерева:
ru_uk: При складанні сторінки декларація формується автоматично на підставі даних з БЕМ-дерева:

source: Все сущности (блоки, элементы и модификаторы) попадают в декларацию в порядке, указанном в конфигурации сборки.
ru_uk: Всі сутності (блоки, елементи і модифікатори) потрапляють до декларації у порядку, зазначеному в конфігурації збірки.

source: Если на странице используется одна и та же сущность дважды, в декларацию она попадет только один раз.
ru_uk: Якщо на сторінці використовується одна і та ж сутність двічі, в декларацію вона потрапить тільки один раз.

source: Вложенность блоков и элементов в декларации не отображается.
ru_uk: Вкладеність блоків і елементів в декларації не відображаються.

source: Один из инструментов, позволяющих получить БЭМ-дерево по HTML-структуре страницы, — [html2bemjson](https://github.com/bem-incubator/html2bemjson).
ru_uk: Один з інструментів, що дозволяють отримати БЕМ-дерево з HTML-структурі сторінки, — [html2bemjson](https://github.com/bem-incubator/html2bemjson).

source: ![Способ создания декларации](declarations__html2decl.png)
ru_uk: ![Спосіб створення декларації](declarations__html2decl.png)

source: Пример проекта, в котором формируется отдельная декларация для каждой страницы, — [Создаем свой проект на БЭМ](https://ru.bem.info/tutorials/start-with-project-stub/).
ru_uk: Приклад проекту, в якому формується окрема декларація для кожної сторінки, — [Створюємо свій проект на БЕМ](https://ru.bem.info/tutorials/start-with-project-stub/).

source: Создание декларации с помощью интроспекции файловой системы
ru_uk: Створення декларації з допомогою інтроспекції файлової системи

source: Другой источник, откуда можно собрать данные о сущностях — файловая система проекта.
ru_uk: Інше джерело, звідки можна зібрати дані про сутності — файлова система проекту.

source: Такой способ построения декларации автоматически включает все сущности, находящиеся в файловой системе проекта.
ru_uk: Такий спосіб побудови декларації автоматично включає всі сутності, що знаходяться у файловій системі проекту.

source: Это обеспечивает стопроцентное попадание в сборку всех необходимых сущностей, но не предоставляет точности: в сборку попадут все имеющиеся сущности, а не только нужные.
ru_uk: Це забезпечує стовідсоткове потрапляння в збірку всіх необхідних сутностей, але не надає точності: в збірку потраплять всі наявні сутності, а не лише потрібні.

source: Декларация, созданная по описанию страницы, наоборот, обеспечивает точечную сборку нужных БЭМ-сущностей, но не может гарантировать подключение всех сущностей, явно не описанных в HTML-файле страницы.
ru_uk: Декларація, створена за описом сторінки, навпаки, забезпечує точкову збирання потрібних БЕМ-сутностей, але не може гарантувати підключення всіх сутностей, явно не описаних у файлі HTML сторінки.

source: ![Способ создания декларации](declarations__fs2decl.png)
ru_uk: ![Спосіб створення декларації](declarations__fs2decl.png)

source: В [bem-components](https://ru.bem.info/libs/bem-components/) создание декларации с помощью интроспекции файловой системы используется для поставки библиотеки в виде [Dist](https://ru.bem.info/libs/bem-components/current/#Варианты-поставки-библиотеки).
ru_uk: В [bem-components](https://ru.bem.info/libs/bem-components/) створення декларації з допомогою інтроспекції файлової системи використовується для поставки бібліотеки у вигляді [Dist](https://ru.bem.info/libs/bem-components/current/#Варианты-поставки-библиотеки).

source: Алгебра деклараций
ru_uk: Алгебра декларацій

source: С помощью деклараций можно управлять процессом сборки.
ru_uk: З допомогою декларацій можна керувати процесом збірки.

source: Например, можно объединять декларации разных страниц в одну и собирать весь проект целиком, а не постранично.
ru_uk: Наприклад, можна об'єднувати декларації різних сторінок в одну і збирати весь проект цілком, а не посторінково.

source: Декларации можно не только совмещать, но и повторно использовать, выделять общие части или различия.
ru_uk: Декларації можна не тільки поєднувати, але і повторно використовувати, виділяти загальні частини або відмінності.

source: Такое управление дает возможность собирать все страницы в один [бандл](../build/build.ru.md#bundle), догружать необходимые части страницы по требованию или повторно использовать уже собранные общие компоненты на разных страницах.
ru_uk: Таке управління дає можливість збирати всі сторінки в один [бандл](../build/build.ru.md#bundle), довантажувати необхідні частині сторінки на вимогу або повторно використовувати вже зібрані загальні компоненти на різних сторінках.

source: Операции над декларациями
ru_uk: Операції над деклараціями

source: [сложение](#Объединение-нескольких-деклараций-в-одну) — объединение множеств сущностей разных деклараций в одну;
ru_uk: [додати](#Об'єднання кількох-декларацій-в-одну) — об'єднання множин сутностей різних декларацій в одну;

source: [вычитание](#Получение-разницы-между-декларациями) — получение разницы между множествами сущностей разных деклараций;
ru_uk: [віднімання](#Одержання різниці між-деклараціями) — одержання різниці між множинами сутностей різних декларацій;

source: [пересечение](#Получение-декларации-на-основе-пересечения-нескольких-других) — получение декларации на основании пересечения множеств сущностей двух других деклараций.
ru_uk: [перетин](#Одержання декларації-на-основі-перетину кількох інших) — отримання декларації на підставі перетину множин сутностей двох інших декларацій.

source: Сложение деклараций
ru_uk: Складання декларацій

source: Применяется для создания общих файлов технологий (например, общего CSS- и JavaScript-файла) для нескольких страниц.
ru_uk: Застосовується для створення загальних файлів технологій (наприклад, загального CSS і JavaScript-файл) для декількох сторінок.

source: Используется, если необходимо загрузить все страницы одновременно и не тратить время на загрузку каждой отдельной страницы при переходе между ними.
ru_uk: Використовується, якщо необхідно завантажити всі сторінки одночасно і не витрачати час на завантаження кожної окремої сторінки при переході між ними.

source: Декларация 1 Декларация 2 Декларация 3 [ [ [ 'header', 'header', 'header', 'input', 'input', 'input', 'button', 'button', 'button', 'link', 'link', 'attach', + = 'attach', 'menu', 'menu', 'image', 'image', 'checkbox', 'checkbox', 'popup' 'popup', 'textarea' 'textarea' ] ] ]
ru_uk: Декларація 1 Декларація 2 Декларація 3 [ [ [ 'header', 'header', 'header', 'input', 'input', 'input', 'button', 'button', 'button', 'link', 'link', 'attach', + = 'attach', 'menu', 'menu', 'image', 'image', 'checkbox', 'checkbox', 'popup' 'popup', 'textarea' 'textarea' ] ] ]

source: Вычитание деклараций
ru_uk: Віднімання декларацій

source: Один из способов применения — сборка части страницы, которая догружается по требованию (например, в ответ на действие пользователя).
ru_uk: Один із способів застосування — збірка частині сторінки, яка догружается на вимогу (наприклад, у відповідь на дію користувача).

source: Декларация 1 Декларация 2 Декларация 3 [ [ [ 'button', 'button', 'checkbox', 'checkbox', 'textarea', 'textarea', 'suggest' 'suggest' 'header', - 'input', = 'button', 'menu', 'image', 'popup' ] ] ]
ru_uk: Декларація 1 Декларація 2 Декларація 3 [ [ [ 'button', 'button', 'checkbox', 'checkbox', 'textarea', 'textarea', 'suggest' 'suggest' 'header', - 'input', = 'button', 'menu', 'image', 'popup' ] ] ]

source: Например, на странице используется виртуальная клавиатура, которая становится доступна пользователю только в ответ на определенное действие.
ru_uk: Наприклад, на сторінці використовується віртуальна клавіатура, яка стає доступною користувачеві тільки у відповідь на певну дію.

source: Нет необходимости включать этот блок в сборку всей страницы, так как это увеличит время загрузки.
ru_uk: Немає необхідності включати цей блок в збірку всієї сторінки, так як це збільшить час завантаження.

source: Кнопки клавиатуры могут быть уже реализованы на странице для других целей.
ru_uk: Кнопки клавіатури можуть бути реалізовані на сторінці для інших цілей.

source: Возможность вычитать декларации позволяет создать отдельный бандл (файлы для части страницы) для недостающей реализации виртуальной клавиатуры и подключать его только по требованию.
ru_uk: Можливість віднімати декларації дозволяє створити окремий пакет (файли для частини сторінки) для відсутньої реалізації віртуальної клавіатури і підключати його тільки на вимогу.

source: Пересечение деклараций
ru_uk: Перетин декларацій

source: Применяется для создания декларации, описывающей общие части разных страниц проекта.
ru_uk: Застосовується для створення декларації, що описує загальні частини різних сторінок проекту.

source: Это позволяет собрать общую часть для всех страниц и подключать ее при сборке один раз ко всем страницам.
ru_uk: Це дозволяє зібрати загальну частину для всіх сторінок і підключати її при складанні один раз до всіх сторінок.

source: Декларация 1 Декларация 2 Декларация 3 [ [ [ 'header', 'header', 'header', 'input', 'menu', 'link', ⋂ 'button', = 'attach', 'input', 'checkbox', 'image', 'textarea', 'popup', 'footer' 'footer' 'footer' ] ] ]
ru_uk: Декларація 1 Декларація 2 Декларація 3 [ [ [ 'header', 'header', 'header', 'input', 'menu', 'link', ⋂ 'button', = 'attach', 'input', 'checkbox', 'image', 'textarea', 'popup', 'footer' 'footer' 'footer' ] ] ]

source: Например, такое разделение эффективно, если в проекте на всех страницах используется `шапка` и `подвал`.
ru_uk: Наприклад, такий поділ ефективно, якщо в проекті на всіх сторінках використовується `шапка` і `підвал`.

source: Общая часть страниц описывается в отдельной декларации.
ru_uk: Загальна частина сторінок описується в окремій декларації.

source: При сборке каждая страница формируется на основании двух деклараций: общей (содержащей `шапку` и `подвал`) и собственной (описывающей оставшуюся часть страницы).
ru_uk: При складанні кожна сторінка формується на підставі двох декларацій: загальної (містить `шапка` і `підвал`) і власної (яка описує частину сторінки).
