Repository: OleksandraP/translation
Catalog: methodology/solved-problems/solved-problems.*.xlf
Languages: ru_uk

source: Решение распространенных проблем веб-разработки с помощью БЭМ
ru_uk: Рішення типових проблем веб-розробки з допомогою БЕМ

source: Методология БЭМ задает [правила по именованию CSS-селекторов](../naming-convention/naming-convention.ru.md), соблюдение которых решает ряд проблем веб-разработки и отвечает на следующие вопросы:
ru_uk: Методологія БЕМ задає [правила іменування CSS селекторів](../naming-convention/naming-convention.ru.md), дотримання яких вирішує ряд проблем веб-розробки і відповідає на наступні питання:

source: [Как упростить код и облегчить рефакторинг](#Как-упростить-код-и-облегчить-рефакторинг)
ru_uk: [Як спростити код і полегшити рефакторинг](#Як-спростити-код-і-полегшити-рефакторинг)

source: [Как получить самодокументируемый код](#Как-получить-самодокументируемый-код)
ru_uk: [Як отримати самодокументируемый код](#Як-отримати-самодокументируемый-код)

source: [Как начать повторно использовать код и избежать взаимного влияния компонентов друг на друга](#Как-начать-повторно-использовать-код-и-избежать-взаимного-влияния-компонентов-друг-на-друга)
ru_uk: [Як почати повторно використовувати код і уникнути взаємного впливу компонентів один на одного](#Як-почати-повторно-використовувати-код-і-уникнути взаємного впливу-компонентів-один-на-одного)

source: [Как разместить несколько сущностей на одном DOM-узле и избежать «Copy-Paste»](#Как-разместить-несколько-сущностей-на-одном-dom-узле-и-избежать-copy-paste)
ru_uk: [Як розмістити кілька сутностей на одному DOM-вузлі і уникнути «Copy-Paste»](#Як-the-кілька-сутностей-на-одному-dom-сайті-і-уникнути-copy-paste)

source: Как упростить код и облегчить рефакторинг
ru_uk: Як спростити код і полегшити рефакторинг

source: При верстке проекта компоненты интерфейса получают имена на основе контекста, с которым работает разработчик.
ru_uk: При верстці проекту компоненти інтерфейсу отримують імена на основі контексту, з яким працює розробник.

source: Обычно контекстом служит страница или какая-то ее часть.
ru_uk: Зазвичай контекстом служить сторінка або якась її частина.

source: Когда страницу верстает один разработчик в короткие сроки, коллизии имен можно избежать.
ru_uk: Коли сторінку верстає один розробник в короткі терміни, колізії імен можна уникнути.

source: Но если над проектом работают несколько человек или правки нужно внести спустя какое-то время, то отследить зависимые имена компонентов становится сложно.
ru_uk: Але якщо над проектом працюють кілька осіб або правки потрібно внести через якийсь час, то відстежити залежні імена компонентів стає складно.

source: В больших проектах результатом правки одного класса может стать десяток «разъехавшихся» страниц.
ru_uk: У великих проектах результатом правки одного класу може стати десяток «роз'їхалися» сторінок.

source: Например, для создания навигационного меню могут использоваться следующие имена классов:
ru_uk: Наприклад, для створення навігаційного меню можуть використовуватися такі імена класів:

source: К ним могут быть написаны CSS-правила:
ru_uk: До них можуть бути написані CSS-правил:

source: Если понадобится добавить на страницу другой компонент, содержащий пункты, то стили для нового `item` повлияют на пункты из существующего навигационного меню.
ru_uk: Якщо знадобиться додати на сторінку інший компонент, що містить пункти, стилі для нового `item` вплинуть на пункти з існуючого навігаційного меню.

source: Или предположим, что в навигационном меню нужно изменить правила класса `.active`.
ru_uk: Або припустимо, що в навігаційному меню потрібно змінити правила класу `.active`.

source: По имени непонятно, какие компоненты его используют.
ru_uk: По імені незрозуміло компоненти, які його використовують.

source: Может оказаться, что на другой странице существует, например, кнопка `<div class="button active">Нажми меня!</div>`.
ru_uk: Може виявитися, що на іншій сторінці існує, наприклад, кнопка `<div class="button active">Натисни мене!</div>`.

source: Тогда изменение правил для `.active` повлияет на стили этой кнопки.
ru_uk: Тоді зміна правил для `.active` вплине на стилі цієї кнопки.

source: Чтобы разобраться, можно ли безболезненно изменить стили для класса `.active`, разработчику придется просмотреть всю структуру страницы или проекта.
ru_uk: Щоб розібратися, чи можна безболісно змінити стилі для класу `.active`, розробнику доведеться переглянути всю структуру сторінки або проекту.

source: Любое изменение потребует значительных временных затрат только на поиск зависимых компонентов.
ru_uk: Будь-яка зміна потребуватиме значних часових витрат тільки на пошук залежних компонентів.

source: **Решение**
ru_uk: **Рішення**

source: Методология БЭМ решает проблему коллизии имен при помощи [соглашения по именованию CSS-классов](../naming-convention/naming-convention.ru.md#Соглашение-по-именованию-css-селекторов), предоставляя всем компонентам и их составляющим уникальные имена.
ru_uk: Методологія БЕМ вирішує проблему колізії імен за допомогою [угоди щодо іменування CSS-класів](../naming-convention/naming-convention.ru.md#Угода-по-іменування-css селекторів), надаючи всім компонентів та їх складових унікальні імена.

source: Применение правил по именованию позволяет:
ru_uk: Застосування правил іменування дозволяє:

source: задавать уникальные имена [БЭМ-сущностям](../key-concepts/key-concepts.ru.md#БЭМ-сущность);
ru_uk: задавати унікальні імена [БЕМ-сутностей](../key-concepts/key-concepts.ru.md#БЕМ-сутність);

source: отслеживать иерархические связи в пределах блока;
ru_uk: відстежувати ієрархічні зв'язки в межах блоку;

source: упрощать восприятие кода;
ru_uk: спрощувати сприйняття коду;

source: получать [самодокументируемый код](#Как-получить-самодокументируемый-код).
ru_uk: отримувати [самодокументируемый код](#Як-отримати-самодокументируемый-код).

source: Рассмотрим тот же пример навигационного меню:
ru_uk: Розглянемо той же приклад навігаційного меню:

source: Но применим к нему правила именования БЭМ: класс `nav` будет обозначать имя блока, `nav__item` и `nav__link` — имена элементов, а `nav__item_active` — имя модификатора элемента `item`.
ru_uk: Але застосуємо до нього правила іменування БЕМ: клас `nav` буде позначати ім'я блоку, `nav__item` і `nav__link` — імена елементів, а `nav__item_active` — ім'я модифікатора елемента `item`.

source: В таком случае запись будет следующей:
ru_uk: У такому випадку запис буде наступною:

source: И, соответственно, CSS будет иметь такой вид:
ru_uk: І, відповідно, CSS буде мати такий вигляд:

source: Новые имена CSS-классов содержат всю информацию о структуре блока.
ru_uk: Нові імена CSS-класів містять всю інформацію про структуру блоку.

source: А это значит, что больше не нужно просматривать HTML-код страницы, чтобы определить все зависимости.
ru_uk: А це значить, що більше не потрібно переглядати HTML-код сторінки, щоб визначити всі залежності.

source: Cелектор всегда содержит знания о том, на какой блок или элемент влияют его правила (в данном случае на элемент `nav__item`).
ru_uk: Селектор завжди містить знання про те, на який блок або елемент впливають його правила (в даному випадку на елемент `nav__item`).

source: Разработчику не придется думать о возможном существовании кнопки `<div class="button active">Нажми меня!</div>`, так как еe CSS-правила будут записаны как `.button_active` и не будут зависеть от правил модификатора `active` для пункта меню (`nav__item_active`).
ru_uk: Розробникам не доведеться думати про можливе існування кнопки `<div class="button active">Натисни мене!</div>`, так як її CSS-правила будуть записані як `.button_active` і не будуть залежати від правил модифікатора `active` для пункту меню (`nav__item_active`).

source: Использование длинных имен имеет следующие недостатки:
ru_uk: Використання довгих імен має наступні недоліки:

source: Результирующий код весит больше.
ru_uk: Результуючий код важить більше.

source: Эта проблема решается `gzip`, который сжимает повторяющиеся последовательности в именах.
ru_uk: Ця проблема вирішується `gzip`, який стискає повторювані послідовності в іменах.

source: Времени на написание классов тратится больше.
ru_uk: Часу на написання класів витрачається більше.

source: Эту проблему помогают решить автозаполнение в редакторе, использование CSS-препроцессоров и шаблонизаторов, которые автоматически добавляют префиксы.
ru_uk: Цю проблему допомагають вирішити автозаповнення в редакторі, використання CSS препроцесорів і шаблонизаторов, які автоматично додають префікси.

source: Длинные имена классов предоставляют явные связи между составными частями компонентов, что экономит время на изучение архитектуры проекта.
ru_uk: Довгі імена класів надають явні зв'язки між складовими частинами компонентів, що економить час на вивчення архітектури проекту.

source: Как получить самодокументируемый код
ru_uk: Як отримати самодокументируемый код

source: При переходе на новый проект разработчик тратит много усилий на то, чтобы понять, как все устроено, где что лежит и как работает код.
ru_uk: При переході на новий проект розробник витрачає багато зусиль на те, щоб зрозуміти, як все влаштовано, де що лежить і як працює код.

source: Порой именно на такое изучение уходит большая часть времени, а вовсе не на реализацию функциональности или исправление ошибки.
ru_uk: Часом саме на таке вивчення йде велика частина часу, а зовсім не на реалізацію функціональності або виправлення помилки.

source: **Решение**
ru_uk: **Рішення**

source: Одна из целей БЭМ — дать понять, что делает тот или иной код, только по названиям классов.
ru_uk: Одна з цілей БЕМ — дати зрозуміти, що робить той чи інший код, тільки за назвами класів.

source: Идея самодокументируемого кода заключается в том, чтобы при просмотре CSS-классов, переменных и функций было понятно, как работает код, и как взаимодействуют компоненты интерфейса.
ru_uk: Ідея самодокументируемого коду полягає в тому, щоб при перегляді CSS-класів, змінних і функцій було зрозуміло, як працює код, і як взаємодіють компоненти інтерфейсу.

source: Используя БЭМ, можно получить HTML с именами классов, показывающих взаимодействие следующих частей кода:
ru_uk: Використовуючи БЕМ, можна отримати HTML з іменами класів, показують взаємодію таких частин коду:

source: независимых [блоков](../key-concepts/key-concepts.ru.md#Блок);
ru_uk: незалежних [блоків](../key-concepts/key-concepts.ru.md#Блок);

source: [элементов](../key-concepts/key-concepts.ru.md#Элемент) (дочерних компонентов) этого блока;
ru_uk: [елементів](../key-concepts/key-concepts.ru.md#Елемент) (дочірніх компонентів) цього блоку;

source: [модификаторов](../key-concepts/key-concepts.ru.md#Модификатор) блока или элемента.
ru_uk: [модифікаторів](../key-concepts/key-concepts.ru.md#Модифікатор) блоку або елемента.

source: Рассмотрим пример с формой поиска на сайте.
ru_uk: Розглянемо приклад з формою пошуку на сайті.

source: Не будем обращаться к HTML, попытаемся прочитать только CSS и понять, какую часть интерфейса он описывает.
ru_uk: Не будемо звертатися до HTML, спробуємо прочитати тільки CSS і зрозуміти, яку частину інтерфейсу він описує.

source: Вариант реализации формы в классической верстке:
ru_uk: Варіант реалізації форми в класичній верстання:

source: Такой способ записи не отражает связи между:
ru_uk: Такий спосіб запису не відображає зв'язок між:

source: компонентами и их составными частями;
ru_uk: компонентами та їх складовими частинами;

source: селекторами и конкретными компонентами интерфейса, к которым они относятся.
ru_uk: селекторами і конкретними компонентами інтерфейсу, до яких вони відносяться.

source: Использование глобальных селекторов делает код проекта нерасширяемым, так как внесение минимальных изменений повлечет за собой правки во всех зависимых правилах.
ru_uk: Використання глобальних селекторів робить код проекту нерасширяемым, так як внесення мінімальних змін спричинить за собою виправлення у всіх залежних правилах.

source: Напишем CSS на классы:
ru_uk: Напишемо CSS на класи:

source: Код стал информативнее: теперь понятно, что есть форма, поле и какой-то компонент `submit`.
ru_uk: Код став інформації: тепер зрозуміло, що є форма, поле і якийсь компонент `submit`.

source: Но такие имена все еще не дают понять, относится ли поле (`field`) к форме (`form`), или что произойдет, если полей или форм на странице будет несколько.
ru_uk: Але такі імена все ще не дають зрозуміти, чи відноситься поле (`field`) до формі (`form`), або що станеться, якщо полів або форм на сторінці буде кілька.

source: Снова возникает необходимость обращаться к HTML.
ru_uk: Знову виникає необхідність звертатися до HTML.

source: Перепишем пример, используя [соглашение по именованию БЭМ](../naming-convention/naming-convention.ru.md):
ru_uk: Перепишемо приклад, використовуючи [угода щодо іменування БЕМ](../naming-convention/naming-convention.ru.md):

source: Такая запись дает понять, как работает данный код.
ru_uk: Такий запис дає зрозуміти, як працює даний код.

source: Имена CSS-классов показывают, что:
ru_uk: Імена CSS-класів показують, що:

source: Существует форма, реализованная блоком `form`.
ru_uk: Існує форма, реалізована блоком `form`.

source: Модификатор `form_search` указывает на то, что речь идет о форме поиска.
ru_uk: Модифікатор `form_search` вказує на те, що мова йде про форму пошуку.

source: У формы есть составляющие — вложенные элементы: поле `form__field` и кнопка `form__submit-button`.
ru_uk: У форми є складові — вкладені елементи: поле `form__field` кнопка `form__submit-button`.

source: Следование соглашению по именованию БЭМ позволяет понять структуру блока без подробного изучения HTML.
ru_uk: Дотримання угоди щодо іменування БЕМ дозволяє зрозуміти структуру блоку без докладного вивчення HTML.

source: Даже при появлении на странице еще одного поля (кроме `form__field`), его правила никак не будут влиять на элементы поисковой формы.
ru_uk: Навіть при появі на сторінці ще одного поля (крім `form__field`), його правила ніяк не будуть впливати на елементи пошукової форми.

source: Новое поле будет реализовано как элемент другого блока и будет иметь свое уникальное имя.
ru_uk: Нове поле буде реалізовано як елемент іншого блоку і буде мати своє унікальне ім'я.

source: Например, `attach__field`.
ru_uk: Наприклад, `attach__field`.

source: Правила именования БЭМ позволяют сделать код проекта однозначным и, как следствие, информативным.
ru_uk: Правила іменування БЕМ дозволяють зробити код проекту однозначним і, як наслідок, інформативним.

source: Это снижает порог входа для других разработчиков.
ru_uk: Це знижує поріг входу для інших розробників.

source: Как начать повторно использовать код и избежать взаимного влияния компонентов друг на друга
ru_uk: Як почати повторно використовувати код і уникнути взаємного впливу компонентів один на одного

source: Разработчик использует схожий набор компонентов при разработке страниц одного проекта.
ru_uk: Розробник використовує схожий набір компонентів при розробці сторінок одного проекту.

source: Например, на странице может быть несколько типов блока `menu`.
ru_uk: Наприклад, на сторінці може бути кілька типів блоку `menu`.

source: Рассмотрим проблему на примере навигационного меню:
ru_uk: Розглянемо проблему на прикладі навігаційного меню:

source: CSS-стили к пункту `item` могут быть записаны как:
ru_uk: CSS-стилі до пункту `item` можуть бути записані як:

source: Если на страницу понадобится добавить дополнительные компоненты, содержащие пункты, то появится еще один блок кода с классом `item`, например:
ru_uk: Якщо на сторінку знадобиться додати додаткові компоненти, що містять пункти, то з'явиться ще один блок коду з класом `item`, наприклад:

source: В этом случае CSS может быть оформлен с помощью каскадов.
ru_uk: У цьому випадку CSS може бути оформлений за допомогою каскадів.

source: Для этого достаточно доопределить правила, уже написанные для `.item`:
ru_uk: Для цього достатньо довизначити правила, вже написані для `.item`:

source: Подобный код может работать до тех пор, пока не возникнет необходимость изменить страницу.
ru_uk: Такий код може працювати до тих пір, поки не виникне необхідність змінити сторінку.

source: Например, переместить пункты меню, использовать написанный код в другом месте отдельно от родительского компонента или вложить навигационное меню в блок `snippets`.
ru_uk: Наприклад, перемістити пункти меню, використовувати написаний код у іншому місці окремо від батьківського компонента або вкласти навігаційне меню в блок `snippets`.

source: Использование каскадов связывает независимые компоненты интерфейса: нет возможности исправить один компонент, не затронув стили другого.
ru_uk: Використання каскадів пов'язує незалежні компоненти інтерфейсу: немає можливості виправити один компонент, не торкнувшись стилі іншого.

source: **Решение**
ru_uk: **Рішення**

source: [Правила по именованию CSS-селекторов](../naming-convention/naming-convention.ru.md) дают возможность вносить изменения точечно, не затрагивая зависимые компоненты.
ru_uk: [Правила іменування CSS селекторів](../naming-convention/naming-convention.ru.md) дають можливість вносити зміни точково, не зачіпаючи залежні компоненти.

source: В БЭМ каждый блок имеет уникальное имя и является самодостаточным.
ru_uk: У БЕМ кожен блок має унікальне ім'я і є самодостатнім.

source: Запишем тот же код в соответствии с правилами именования БЭМ:
ru_uk: Запишемо той же код згідно з правилами іменування БЕМ:

source: В таком случае добавление нового пункта `item` на страницу будет выглядеть так:
ru_uk: У такому разі додавання нового пункту `item` на сторінку буде виглядати так:

source: Пункт `snippets__item` будет иметь соответствующие только ему уникальные CSS-правила:
ru_uk: Пункт `snippets__item` буде мати відповідні тільки йому унікальні CSS-правил:

source: Изменения в `nav__item` не влияют на `snippets__item`, так как пункты получают уникальные имена благодаря [пространству имен](https://ru.wikipedia.org/wiki/Пространство_имён_%28программирование%29), заданному именем блока.
ru_uk: Зміни в `nav__item` не впливають на `snippets__item`, так як пункти отримують унікальні імена завдяки [простору імен](https://ru.wikipedia.org/wiki/Пространство_имен_%28программирование%29), заданим ім'ям блоку.

source: Это позволяет формировать независимые CSS-правила для всех элементов блока.
ru_uk: Це дозволяє формувати незалежні CSS-правила для всіх елементів блоку.

source: Такой подход дает возможность защитить элементы от взаимного влияния друг на друга — элементы всегда являются частью блока.
ru_uk: Такий підхід дає можливість захистити елементи від взаємного впливу один на одного — елементи завжди є частиною блоку.

source: Такой же принцип работы использует и Shadow DOM в Web Components.
ru_uk: Такий же принцип роботи використовує і Shadow DOM в Web Components.

source: Но, в отличие от Shadow DOM, применение соглашения по именованию БЭМ не зависит от совместимости с работой браузеров.
ru_uk: Але, на відміну від Shadow DOM, застосування угоди щодо іменування БЕМ не залежить від сумісності з роботою браузерів.

source: Блоки `snippets` и `nav` можно повторно использовать и перемещать по странице или проекту.
ru_uk: Блоки `snippets` і `nav` можна повторно використовувати і переміщати по сторінці або проектом.

source: Уникальность имен классов, основанная на правилах именования БЭМ, позволяет блокам не зависеть друг от друга.
ru_uk: Унікальність імен класів, заснована на правилах іменування БЕМ, дозволяє блокам не залежати один від одного.

source: Использование каскадов в БЭМ
ru_uk: Використання каскадів у БЕМ

source: Методология БЭМ допускает использование каскадов.
ru_uk: Методологія БЕМ допускає використання каскадів.

source: Например, каскад уместен, чтобы менять элементы в зависимости от состояния блока или заданной ему темы:
ru_uk: Наприклад, каскад доречний, щоб змінювати елементи в залежності від стану блоку або заданої йому теми:

source: **Важно!** Применение каскада увеличивает связанность кода и делает его повторное использование невозможным.
ru_uk: **Важливо!** Застосування каскаду збільшує зв'язаність коду і робить його повторне використання неможливим.

source: Как разместить несколько сущностей на одном DOM-узле и избежать «Copy-Paste»
ru_uk: Як розмістити кілька сутностей на одному DOM-вузлі і уникнути «Copy-Paste»

source: При работе с проектами может потребоваться повторно использовать реализованную функциональность.
ru_uk: При роботі з проектами може знадобитися повторно використовувати реалізовану функціональність.

source: Во многих случаях такую проблему решают копированием нужной части кода в новый компонент.
ru_uk: У багатьох випадках таку проблему вирішують копіюванням потрібної частини коду в новий компонент.

source: Такой подход имеет следующие недостатки:
ru_uk: Такий підхід має наступні недоліки:

source: увеличивается кодовая база проекта;
ru_uk: збільшується кодова база проекту;

source: затрудняется отладка кода при выявлении ошибки.
ru_uk: може налагодження коду при виявленні помилки.

source: Как следствие, разработчик вынужден поддерживать большее количество строк кода, а исправления необходимо вносить отдельно в каждую реализацию.
ru_uk: Як наслідок, розробник змушений підтримувати більшу кількість рядків коду, а виправлення треба вносити окремо в кожну реалізацію.

source: Это увеличивает временные затраты на отладку и поддержку проекта.
ru_uk: Це збільшує часові витрати на налагодження і підтримку проекту.

source: **Решение**
ru_uk: **Рішення**

source: Воспользуемся примером, который реализует универсальный блок навигационного меню и написан по всем [правилам именования БЭМ](../naming-convention/naming-convention.ru.md).
ru_uk: Скористаємося прикладом, який реалізує універсальний блок навігаційного меню та написаний за всіма [правилами іменування БЕМ](../naming-convention/naming-convention.ru.md).

source: Такой блок можно использовать, например, для навигации по статьям в блоке новостей.
ru_uk: Такий блок можна використовувати, наприклад, для навігації по статтям в блоці новин.

source: Допустим, в разделе новостей уже есть блок `articles`, которому написаны все необходимые CSS-правила.
ru_uk: Припустимо, в розділі новин вже є блок `articles`, якому написані всі необхідні CSS-правила.

source: Смешать реализации двух разных блоков без копирования кода можно при помощи [микса](../key-concepts/key-concepts.ru.md#Микс).
ru_uk: Змішати реалізації двох різних блоків без копіювання коду можна за допомогою [міксу](../key-concepts/key-concepts.ru.md#Мікс).

source: То есть разместить на одном DOM-узле блок `nav` и элемент `articles__nav`.
ru_uk: Тобто розмістити на одному DOM-сайті блок `nav` елемент `articles__nav`.

source: В коде это будет выглядеть так:
ru_uk: У коді це буде виглядати так:

source: Такая реализация позволит объединить функциональность блока `nav` и особенности реализации элемента `articles__nav` (внешний вид новостных статей в меню).
ru_uk: Така реалізація дозволить об'єднати функціональність блоку `nav` і особливості реалізації елемента `articles__nav` (зовнішній вигляд новинних статей в меню).

source: При этом нет необходимости копировать уже имеющиеся CSS-правила.
ru_uk: При цьому немає необхідності копіювати вже наявні CSS-правила.

source: При обнаружении ошибки, правки необходимо будет внести только в одну часть кода.
ru_uk: При виявленні помилки, виправлення необхідно буде внести тільки одну частину коду.

source: Миксовать можно не только блоки с элементами, но и другие БЭМ-сущности.
ru_uk: Міксувати можна не тільки блоки з елементами, але і інші БЕМ-сутності.

source: Подробнее о вариантах использования миксов в БЭМ читайте в разделе [Основные понятия БЭМ](../key-concepts/key-concepts.ru.md#Микс).
ru_uk: Детальніше про варіанти використання міксів в БЕМ читайте у розділі [Основні поняття БЕМ](../key-concepts/key-concepts.ru.md#Мікс).
