Repository: OleksandraP/translation
Catalog: methodology/faq/faq.*.xlf
Languages: ru_uk

source: Часто задаваемые вопросы
ru_uk: Часті питання

source: Почему БЭМ?
ru_uk: Чому БЕМ?

source: [В чем отличие БЭМ от OOCSS, AMCSS, SMACSS, SUITCSS?](#В-чем-отличие-БЭМ-от-oocss-amcss-smacss-suitcss)
ru_uk: [У чому відмінність БЕМ від OOCSS, AMCSS, SMACSS, SUITCSS?](#У-відмінність-БЕМ-від-oocss-amcss-smacss-suitcss)

source: [В чем разница между БЭМ и Web Components?](#В-чем-разница-между-БЭМ-и-web-components)
ru_uk: [У чому різниця між БЕМ і Web Components?](#- Різниця-між-БЕМ-і-web-components)

source: [В чем разница между БЭМ и Bootstrap?](#В-чем-разница-между-БЭМ-и-bootstrap)
ru_uk: [У чому різниця між БЕМ і Bootstrap?](#- Різниця-між-БЕМ-і-bootstrap)

source: Блоки и элементы
ru_uk: Блоки та елементи

source: [В каком случае создавать блок, в каком — элемент?](#В-каком-случае-создавать-блок-в-каком--элемент)
ru_uk: [В якому разі створювати блок, у якому — елемент?](#У-будь-разі-створювати блок--якому--елемент)

source: [Почему в БЭМ не рекомендуется создавать элементы элементов (block__elem1__elem2)?](#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2)
ru_uk: [Чому в БЕМ не рекомендується створювати елементи елементів (block__elem1__elem2)?](#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2)

source: [Зачем писать имя блока в именах модификаторов и элементов?](#Зачем-писать-имя-блока-в-именах-модификаторов-и-элементов)
ru_uk: [Навіщо писати ім'я блоку в іменах модифікаторів і елементів?](#Навіщо писати-ім'я-блоку в іменах-модифікаторів-і-елементів)

source: [Как сделать глобальные модификаторы для блоков?](#Как-сделать-глобальные-модификаторы-для-блоков)
ru_uk: [Як зробити глобальні модифікатори для блоків?](#Як зробити-глобальні-модифікатори-для-блоків)

source: [Зачем создавать отдельные директории и файлы для каждого блока и технологии?](#Зачем-создавать-отдельные-директории-и-файлы-для-каждого-блока-и-технологии)
ru_uk: [Навіщо створювати окремі директорії і файли для кожного блоку і технології?](#Навіщо створювати окремі-директорії і файли-для-кожного блоку-і-технології)

source: [Зачем использовать i-bem.js, если можно писать на jQuery?](#Зачем-использовать-i-bemjs-если-можно-писать-на-jquery)
ru_uk: [Навіщо використовувати i-bem.js якщо можна писати на jQuery?](#Навіщо використовувати-i-bemjs-якщо можна-писати-на-jquery)

source: [Почему нежелательно использовать вложенные селекторы?](#Почему-нежелательно-использовать-вложенные-селекторы)
ru_uk: [Чому небажано використовувати вкладені селектори?](#Чомусь небажано використовувати вкладені-селектори)

source: [Почему в БЭМ не рекомендуется использовать комбинированные селекторы для создания CSS-правил к модификатору?](#Почему-в-БЭМ-не-рекомендуется-использовать-комбинированные-селекторы-для-создания-css-правил-к-модификатору)
ru_uk: [Чому в БЕМ не рекомендується використовувати комбіновані селектори для створення CSS-правил до модификатору?](#Почему-в-БЭМ-не-рекомендуется-использовать-комбинированные-селекторы-для-создания-css-правил-к-модификатору)

source: [Можно ли объединять тег и класс в селекторе (например, button.button)?](#Можно-ли-объединять-тег-и-класс-в-селекторе-Например-buttonbutton)
ru_uk: [Можна об'єднувати тег і клас в селекторі (наприклад, button.button)?](#Можна об'єднувати-тег-та-клас-у-селекторі-Наприклад-buttonbutton)

source: [Почему в БЭМ не используют пользовательские теги (custom tag) для блоков?](#Почему-в-БЭМ-не-используют-пользовательские-теги-custom-tags-для-блоков)
ru_uk: [Чому в БЕМ не використовують користувальницькі теги (custom tag) для блоків?](#Чому-у-БЕМ-не-використовують-користувальницькі теги-custom-tags-для-блоків)

source: [Почему нельзя делать общий сброс стилей (reset)?](#Почему-нельзя-делать-общий-сброс-стилей-reset)
ru_uk: [Чому не можна робити загальний скид стилів (reset)?](#Чомусь не можна робити-загальний-скидання-стилів-reset)

source: [Почему нельзя писать block_mod вместо block block_mod, если имя модификатора уже содержит всю информацию о блоке?](#Почему-нельзя-писать-block_mod-вместо-block-block_mod-если-имя-модификатора-уже-содержит-всю-информацию-о-блоке)
ru_uk: [Чому не можна писати block_mod замість block block_mod, якщо ім'я модифікатора вже містить всю інформацію про блоке?](#Почему-нельзя-писать-block_mod-вместо-block-block_mod-если-имя-модификатора-уже-содержит-всю-информацию-о-блоке)

source: [Почему нельзя указывать название CSS-свойства в имени модификатора: .block__element_border-color_grey?](#Почему-нельзя-указывать-название-css-свойства-в-имени-модификатора-block__element_border-color_grey)
ru_uk: [Чому не можна вказувати назву CSS-властивості в імені модифікатора: .block__element_border-color_grey?](#Почему-нельзя-указывать-название-css-свойства-в-имени-модификатора-block__element_border-color_grey)

source: **Не нашли ответ?** — [Задайте вопрос команде на форуме](https://ru.bem.info/forum/)
ru_uk: **Не знайшли відповідь?** — [Задайте питання команді на форумі](https://ru.bem.info/forum/)

source: В чем отличие БЭМ от OOCSS, AMCSS, SMACSS, SUITCSS?
ru_uk: У чому відмінність БЕМ від OOCSS, AMCSS, SMACSS, SUITCSS?

source: БЭМ работает не только с CSS, но и с JavaScript.
ru_uk: БЕМ працює не тільки з CSS, але і з JavaScript.

source: БЭМ больше схож с Web Components, чем с перечисленными решениями для CSS.
ru_uk: БЕМ більше схожий з Web Components, ніж з перерахованими рішеннями для CSS.

source: ([В чем разница между БЭМ и Web Components?](#В-чем-разница-между-БЭМ-и-web-components))
ru_uk: ([В чому різниця між БЕМ і Web Components?](#- Різниця-між-БЕМ-і-web-components))

source: БЭМ предоставляет комплексное решение по созданию архитектуры проекта и помогает организовать процессы разработки.
ru_uk: БЕМ надає комплексне рішення по створенню архітектури проекту і допомагає організувати процеси розробки.

source: Подробнее читайте в разделе [Применение методологии для решения задач веб-разработки](../method/solved-problems/solved-problems.ru.md).
ru_uk: Детальніше читайте у розділі [Застосування методології для вирішення завдань веб-розробки](../method/solved-problems/solved-problems.ru.md).

source: Подробнее о [методологии БЭМ](https://ru.bem.info/method/).
ru_uk: Докладніше про [методології БЕМ](https://ru.bem.info/method/).

source: Можно использовать БЭМ только на уровне CSS.
ru_uk: Можна використовувати БЕМ тільки на рівні CSS.

source: Для этого достаточно просто следовать [рекомендациям методологии](../method/naming-convention/naming-convention.ru.md).
ru_uk: Для цього досить просто слідувати [рекомендацій методології](../method/naming-convention/naming-convention.ru.md).

source: В чем разница между БЭМ и Web Components?
ru_uk: У чому різниця між БЕМ і Web Components?

source: Поддержка браузеров
ru_uk: Підтримка браузерів

source: Web Components [не поддерживается](http://caniuse.com/#search=Web%20Components) в Safari, iOS Safari, Internet Explorer, Firefox.
ru_uk: Web Components [не підтримується](http://caniuse.com/#search=Web%20Components) в Safari, iOS Safari, Internet Explorer, Firefox.

source: БЭМ работает во всех браузерах.
ru_uk: БЕМ працює у всіх браузерах.

source: Инкапсуляция
ru_uk: Інкапсуляція

source: В Web Components реализована через Shadow DOM.
ru_uk: У Web Components реалізована через Shadow DOM.

source: В БЭМ — с помощью [элементов](../method/key-concepts/key-concepts.ru.md#Элемент) блока.
ru_uk: У БЕМ — з допомогою [елементів](../method/key-concepts/key-concepts.ru.md#Елемент) блоку.

source: Работа шаблонов
ru_uk: Робота шаблонів

source: В Web Components шаблоны всегда выполняются в браузере.
ru_uk: У Web Components шаблони завжди виконуються в браузері.

source: Это может потребовать дополнительных решений проблем с индексацией.
ru_uk: Це може вимагати додаткових рішень проблем з індексацією.

source: В БЭМ генерация шаблона возможна на этапе разработки.
ru_uk: У БЕМ генерація шаблону можлива на етапі розробки.

source: Это позволяет отдавать готовый HTML.
ru_uk: Це дозволяє віддавати готовий HTML.

source: Шаблоны могут выполняться как в браузере, так и на сервере.
ru_uk: Шаблони можуть виконуватися як в браузері, так і на сервері.

source: Web Components использует императивный принцип — интерполяцию строк.
ru_uk: Web Components використовує імперативний принцип — інтерполяцію рядків.

source: БЭМ использует декларативный подход, который позволяет гибко управлять шаблонизацией и избегать повторений.
ru_uk: БЕМ використовує декларативний підхід, який дозволяє гнучко управляти шаблонизацией і уникати повторень.

source: Подробно о разнице между декларативным и императивным подходами смотрите в докладе [Сергея Бережного](https://ru.bem.info/authors/berezhnoy-sergey/) — [Шаблонизаторы](https://events.yandex.ru/lib/talks/553/).
ru_uk: Докладно про різницю між декларативним та імперативним підходами дивіться у доповіді [Сергія Бережного](https://ru.bem.info/authors/berezhnoy-sergey/) — [Шаблонизаторы](https://events.yandex.ru/lib/talks/553/).

source: Вместо импорта HTML — сборка
ru_uk: Замість імпорту HTML — збірка

source: Web Components использует импорт HTML (HTML Imports), который работает непосредственно в браузере.
ru_uk: Web Components використовує імпорт HTML (HTML Imports), який працює безпосередньо в браузері.

source: Для объединения HTML-файлов используется инструмент [Vulcanize](http://webcomponents.org/articles/introduction-to-html-imports/#aggregating-network-requests).
ru_uk: Для об'єднання HTML-файлів використовується інструмент [Vulcanize](http://webcomponents.org/articles/introduction-to-html-imports/#aggregating-network-requests).

source: БЭМ использует сборщики: [ENB](https://ru.bem.info/tools/bem/enb-bem/) или [bem-tools](https://ru.bem.info/tools/bem/bem-tools/).
ru_uk: БЕМ використовує збирачі: [ENB](https://ru.bem.info/tools/bem/enb-bem/) або [bem-tools](https://ru.bem.info/tools/bem/bem-tools/).

source: Вместо Custom Elements — абстракция над DOM-деревом
ru_uk: Замість Custom Elements — абстракція над DOM-деревом

source: В Web Components используются Custom Elements.
ru_uk: У Web Components використовуються Custom Elements.

source: Такой подход позволяет разместить на одном DOM-узел только один компонент.
ru_uk: Такий підхід дозволяє розмістити на одному DOM-вузол лише один компонент.

source: В БЭМ существует понятие [БЭМ-дерева](../method/key-concepts/key-concepts.ru.md#БЭМ-дерево).
ru_uk: У БЕМ існує поняття [БЕМ-дерева](../method/key-concepts/key-concepts.ru.md#БЕМ-дерево).

source: БЭМ использует [миксы](../method/key-concepts/key-concepts.ru.md#Микс) — размещение нескольких БЭМ-сущностей на одном DOM-узле.
ru_uk: БЕМ використовує [мікси](../method/key-concepts/key-concepts.ru.md#Мікс) — розміщення декількох БЕМ-сутностей на одному DOM-сайті.

source: В чем разница между БЭМ и Bootstrap?
ru_uk: У чому різниця між БЕМ і Bootstrap?

source: В терминах БЭМ [Bootstrap](http://getbootstrap.com/) — это набор сверстанных блоков.
ru_uk: У термінах БЕМ [Bootstrap](http://getbootstrap.com/) — це набір зверстаних блоків.

source: БЭМ — не библиотека элементов интерфейса, а методология, позволяющая:
ru_uk: БЕМ — не бібліотека елементів інтерфейсу, а методологія, що дозволяє:

source: создавать архитектуру проекта;
ru_uk: створювати архітектуру проекту;

source: разрабатывать веб-приложения независимыми блоками;
ru_uk: розробляти веб-додатки незалежними блоками;

source: упрощать поддержку проектов.
ru_uk: спрощувати підтримку проектів.

source: Библиотека блоков, сделанных на БЭМ — [bem-components](https://ru.bem.info/libs/bem-components/).
ru_uk: Бібліотека блоків, зроблених на БЕМ — [bem-components](https://ru.bem.info/libs/bem-components/).

source: Существуют также и [другие](https://ru.bem.info/libs/) БЭМ-библиотеки.
ru_uk: Існують також і [інші](https://ru.bem.info/libs/) БЕМ-бібліотеки.

source: В каком случае создавать блок, в каком — элемент?
ru_uk: В якому випадку створювати блок, у якому — елемент?

source: Если фрагмент кода может использоваться повторно и не зависит от реализации других компонентов страницы, необходимо создавать [блок](../method/key-concepts/key-concepts.ru.md#Блок).
ru_uk: Якщо фрагмент коду може використовуватися повторно і не залежить від реалізації інших компонентів сторінки, необхідно створювати [блок](../method/key-concepts/key-concepts.ru.md#Блок).

source: Если фрагмент кода не может использоваться самостоятельно, без родительской сущности (блока), в большинстве случаев создается [элемент](../method/key-concepts/key-concepts.ru.md#Элемент).
ru_uk: Якщо фрагмент коду не може використовуватися самостійно, без батьківського сутності (блоку), у більшості випадків створюється [елемент](../method/key-concepts/key-concepts.ru.md#Елемент).

source: Исключение составляют элементы, реализация которых для упрощения разработки требует разделения на более мелкие части — подэлементы.
ru_uk: Виняток становлять елементи, реалізація яких для спрощення розробки вимагає поділу на більш дрібні частини — подэлементы.

source: БЭМ-методология [не рекомендует создавать элементы элементов](#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2).
ru_uk: БЕМ-методологія [не рекомендує створювати елементи елементів](#Чому-у-БЕМ-не рекомендовано створювати елементи-елементів-block__elem1__elem2).

source: В подобном случае вместо элемента необходимо создавать служебный блок.
ru_uk: У подібному випадку замість елемента необхідно створювати службовий блок.

source: Почему в БЭМ не рекомендуется создавать элементы элементов (block__elem1__elem2)?
ru_uk: Чому у БЕМ не рекомендується створювати елементи елементів (block__elem1__elem2)?

source: Наличие элементов элементов ограничивает возможность изменять внутреннюю структуру блока: элементы нельзя поменять местами, удалить или добавить без корректировки существующего кода.
ru_uk: Наявність елементів елементів обмежує можливість змінювати внутрішню структуру блоку: елементи можна поміняти місцями, видалити або додати без коригування існуючого коду.

source: В методологии БЭМ вложенную структуру поддерживают только блоки (`block__elem`).
ru_uk: У методології БЕМ вкладену структуру підтримують тільки блоки (`block__elem`).

source: Имя блока задает пространство имен, которое [гарантирует зависимость](../method/naming-convention/naming-convention.ru.md#Имя-элемента) элементов от блока.
ru_uk: Ім'я блоку задає простір імен, що [гарантує залежність](../method/naming-convention/naming-convention.ru.md#Ім'я елемента) елементів від блоку.

source: Блок может иметь вложенную структуру элементов в DOM-дереве:
ru_uk: Блок може мати вкладену структуру елементів в DOM-дереві:

source: Однако эта же структура блока в методологии БЭМ всегда будет представлена плоским списком элементов:
ru_uk: Однак ця ж структура блоку в методології БЕМ завжди буде представлена плоским списком елементів:

source: Это позволяет изменять DOM-структуру блока без внесения правок в коде каждого отдельного элемента:
ru_uk: Це дозволяє змінювати DOM-структуру блоку без внесення виправлень в коді кожного окремого елемента:

source: Структура блока меняется, а правила для элементов и их названия остаются прежними.
ru_uk: Структура блоку змінюється, а правила для елементів і їх назви залишаються колишніми.

source: Зачем писать имя блока в именах модификаторов и элементов?
ru_uk: Навіщо писати ім'я блоку в іменах модифікаторів і елементів?

source: Имя блока в именах [БЭМ-сущностей](../method/key-concepts/key-concepts.ru.md#БЭМ-сущность) обеспечивает:
ru_uk: Ім'я блоку в іменах [БЕМ-сутностей](../method/key-concepts/key-concepts.ru.md#БЕМ-сутність) забезпечує:

source: [Пространство имен](#Пространство-имен)
ru_uk: [Простір імен](#Простір імен)

source: [Миксы](#Миксы)
ru_uk: [Мікси](#Мікси)

source: [Поиск в коде](#Поиск-в-коде)
ru_uk: [Пошук в коді](#Пошук-коді)

source: **Важно!** Методология БЭМ [допускает выбор](../method/naming-convention/naming-convention.ru.md#Альтернативные-схемы-именования) удобной стратегии именования, но требует соблюдения консистентности в названиях.
ru_uk: **Важливо!** Методологія БЕМ [допускає вибір](../method/naming-convention/naming-convention.ru.md#Альтернативні схеми-іменування) зручної стратегії іменування, але вимагає дотримання консистентности в назвах.

source: Так, например, все варианты верны: `context`, `ctx` или `c`, `attributes`, `attrs` или `as`.
ru_uk: Так, наприклад, усі варіанти вірні: `context`, `ctx` або `c`, `attributes`, `attrs` або `as`.

source: Необходимо выбрать один из них и использовать во всем проекте.
ru_uk: Необхідно вибрати один з них і використовувати у всьому проекті.

source: Пространство имен
ru_uk: Простір імен

source: Имя блока задает пространство имен и обеспечивает уникальность имен элементов и модификаторов.
ru_uk: Ім'я блоку задає простір імен і забезпечує унікальність імен елементів і модифікаторів.

source: Это позволяет ограничить влияние элементов и модификаторов одного блока на реализацию другого.
ru_uk: Це дозволяє обмежити вплив елементів і модифікаторів одного блоку на реалізацію іншого.

source: Миксы
ru_uk: Мікси

source: [Микс](../method/key-concepts/key-concepts.ru.md#Микс) — это совмещение разных БЭМ-сущностей на одном DOM-узле.
ru_uk: [Мікс](../method/key-concepts/key-concepts.ru.md#Мікс) — це поєднання різних БЕМ-сутностей на одному DOM-сайті.

source: При миксе модификатора имя блока указывает, к какому блоку применится модификатор.
ru_uk: При міксі модифікатора ім'я блоку вказує, до якого блоку застосувати модифікатор.

source: Если имя блока не указать, модификатор применится ко всем миксуемым БЭМ-сущностям.
ru_uk: Якщо назва блоку не вказати модифікатор застосувати до всіх миксуемым БЕМ-сутностей.

source: Например, рассмотрим микс пункта меню (`menu__item`) и кнопки (`button`):
ru_uk: Наприклад, розглянемо мікс пункту меню (`menu__item`) і кнопки (`button`):

source: Добавим модификатор `active` в сокращенной форме записи (без имени блока):
ru_uk: Додамо модифікатор `active` у скороченій формі запису (без імені блоку):

source: В таком виде HTML-разметка не дает понять, к чему относится модификатор: к пункту меню (`menu__item.active`) или к кнопке (`button.active`).
ru_uk: У такому вигляді HTML-розмітка не дає зрозуміти, до чого відноситься модифікатор: до пункту меню (`menu__item.active`) або до кнопки (`button.active`).

source: Имя блока (`button_active`) явно указывает на БЭМ-сущность, к которой будет применен модификатор.
ru_uk: Ім'я блоку (`button_active`) явно вказує на БЕМ-сутність, до якої буде застосовано модифікатор.

source: Также запись `<div class="block mod">` не дает понять, какие БЭМ-сущности используются в работе.
ru_uk: Також запис `<div class="block mod">` не дає зрозуміти, які БЕМ-сутності використовуються в роботі.

source: Например, из записи `<div class="checkbox button">` нельзя однозначно определить, это микс модификатора и блока или микс двух блоков.
ru_uk: Наприклад, із запису `<div class="checkbox button">` не можна однозначно визначити, це мікс модифікатора і блоку або мікс двох блоків.

source: Полное имя модификатора `<div class="block block_mod">` показывает, о каких сущностях идет речь: `<div class="checkbox checkbox_button">`.
ru_uk: Повне ім'я модифікатора `<div class="block block_mod">` показує, про яких сутності йдеться: `<div class="checkbox checkbox_button">`.

source: Поиск в коде
ru_uk: Пошук в коді

source: Явные и уникальные имена облегчают поиск необходимой сущности в коде и файловой системе.
ru_uk: Явні та унікальні імена полегшують пошук необхідної сутності в коді і файловій системі.

source: Сравним результаты глобального поиска при отладке проекта.
ru_uk: Порівняємо результати глобального пошуку при налагодженні проекту.

source: Найдем модификатор `active`.
ru_uk: Знайдемо модифікатор `active`.

source: В сокращенном виде (`active`) в результаты поиска попадут все возможные комбинации и HTML-фрагменты, где встречается `active`.
ru_uk: У скороченому вигляді (`active`) в результати пошуку потраплять всі можливі комбінації і HTML-фрагменти, де зустрічається `active`.

source: В записи, рекомендуемой методологией, само название уже будет содержать уточняющий параметр в виде имени блока (`button_active`).
ru_uk: У запису, рекомендованої методологією, сама назва вже буде містити уточнюючий параметр у вигляді імені блоку (`button_active`).

source: Так как имя модификатора уникально, в результаты поиска попадут только нужные фрагменты кода.
ru_uk: Так як ім'я модифікатора унікально, в результати пошуку потраплять тільки потрібні фрагменти коду.

source: Как сделать глобальные модификаторы для блоков?
ru_uk: Як зробити глобальні модифікатори для блоків?

source: В БЭМ отсутствует понятие глобальных модификаторов, так как модификатор всегда относится к одной конкретной [БЭМ-сущности](../method/key-concepts/key-concepts.ru.md#БЭМ-сущность).
ru_uk: У БЕМ відсутнє поняття глобальних модифікаторів, так як модифікатор завжди відноситься до однієї конкретної [БЕМ-сутності](../method/key-concepts/key-concepts.ru.md#БЕМ-сутність).

source: Если требуется вынести CSS-свойство за пределы одного блока и применять его к разным БЭМ-сущностям в проекте, необходимо создавать отдельный блок, реализованный в технологии CSS.
ru_uk: Якщо потрібно винести CSS властивість за межі одного блоку і застосовувати його до різних БЕМ-сутностей в проекті, необхідно створювати окремий блок, реалізований в технології CSS.

source: БЭМ позволяет совмещать реализацию разных блоков с помощью [миксов](../method/key-concepts/key-concepts.ru.md#Микс):
ru_uk: БЕМ дозволяє поєднувати реалізацію різних блоків з допомогою [міксів](../method/key-concepts/key-concepts.ru.md#Мікс):

source: Зачем создавать отдельные директории и файлы для каждого блока и технологии?
ru_uk: Навіщо створювати окремі директорії і файли для кожного блоку і технології?

source: Файловая система БЭМ-проекта разделяется на вложенные директории и файлы для [удобства разработки и поддержки проекта](../method/filesystem/filesystem.ru.md#Реализация-блока-разделяется-на-отдельные-файлы).
ru_uk: Файлова система БЕМ-проекту поділяється на вкладені директорії і файли для [зручності розробки і підтримки проекту](../method/filesystem/filesystem.ru.md#Реалізація-блоку-поділяється на окремі файли).

source: Придерживаться [рекомендуемой структуры файловой системы](../method/filesystem/filesystem.ru.md#Организация-файловой-системы-БЭМ-проекта) не обязательно.
ru_uk: Дотримуватися [рекомендованої структури файлової системи](../method/filesystem/filesystem.ru.md#Організація файлової системи-БЕМ-проекту) не обов'язково.

source: Вы можете использовать любую альтернативную структуру проекта, соответствующую [принципам организации файловой системы БЭМ](../method/filesystem/filesystem.ru.md#Принципы-организации-файловой-системы-БЭМ-проекта), например:
ru_uk: Ви можете використовувати будь-яку альтернативну структуру проекту, відповідну [принципам організації файлової системи БЕМ](../method/filesystem/filesystem.ru.md#Принципи організації файлової системи-БЕМ-проекту), наприклад:

source: Блоку соответствует отдельная директория.
ru_uk: Блоку відповідає окрема директорія.

source: Элементы и модификаторы реализованы в отдельных файлах.
ru_uk: Елементи і модифікатори реалізовані в окремих файлах.

source: Блоку соответствует отдельная директория.
ru_uk: Блоку відповідає окрема директорія.

source: Элементы и модификаторы реализованы в файлах блока.
ru_uk: Елементи і модифікатори реалізовані у файлах блоку.

source: Директории для блоков не используются.
ru_uk: Директорії для блоків не використовуються.

source: Элементы и модификаторы реализованы в файлах блока.
ru_uk: Елементи і модифікатори реалізовані у файлах блоку.

source: Директории для блоков не используются.
ru_uk: Директорії для блоків не використовуються.

source: Опциональные элеметы и модификаторы реализованы в отдельных файлах.
ru_uk: Опціональні элеметы і модифікатори реалізовані в окремих файлах.
