Repository: OleksandraP/translation
Catalog: methodology/faq/faq.*.xlf
Languages: ru_uk

source: Зачем использовать i-bem.js, если можно писать на jQuery?
ru_uk: Навіщо використовувати i-bem.js якщо можна писати на jQuery?

source: [i-bem.js](https://ru.bem.info/technology/i-bem/) это специализированный фреймворк для разработки проектов на JavaScript в терминах блоков, элементов и модификаторв.
ru_uk: [i-bem.js](https://ru.bem.info/technology/i-bem/) це спеціалізований фреймворк для розробки проектів на JavaScript в термінах блоків, елементів і модификаторв.

source: `i-bem.js` не предназначен для замены фреймворка общего назначения, такого как jQuery.
ru_uk: `i-bem.js` не призначений для заміни фреймворку загального призначення, такого як jQuery.

source: `i-bem.js` позволяет:
ru_uk: `i-bem.js` дозволяє:

source: разрабатывать веб-интерфейс в терминах блоков, элементов, модификаторов;
ru_uk: розробляти веб-інтерфейс в термінах блоків, елементів, модифікаторів;

source: интегрировать JavaScript-код с шаблонами и CSS-правилами в стиле БЭМ;
ru_uk: інтегрувати JavaScript-код з шаблонами і CSS-правил в стилі БЕМ;

source: описывать логику работы блока как набор состояний.
ru_uk: описувати логіку роботи блоку як набір станів.

source: Почему нежелательно использовать вложенные селекторы?
ru_uk: Чому небажано використовувати вкладені селектори?

source: Ключевая идея БЭМ — независимость блоков.
ru_uk: Ключова ідея БЕМ — незалежність блоків.

source: [Вложенные селекторы](http://htmlbook.ru/css/selector/descendant) увеличивают связанность кода и делают его повторное использование невозможным.
ru_uk: [Вкладені селектори](http://htmlbook.ru/css/selector/descendant) збільшують зв'язаність коду і роблять його повторне використання неможливим.

source: Это противоречит принципам БЭМ.
ru_uk: Це суперечить принципам БЕМ.

source: Методология БЭМ допускает использование таких селекторов, но рекомендует по-максимуму его сократить.
ru_uk: Методологія БЕМ допускає використання таких селекторів, але рекомендує по-максимуму його скоротити.

source: Например, вложенность уместна, чтобы менять элементы в зависимости от состояния блока или заданной ему темы:
ru_uk: Наприклад, вкладеність доречна, щоб змінювати елементи в залежності від стану блоку або заданої йому теми:

source: Почему в БЭМ не рекомендуется использовать комбинированные селекторы для создания CSS-правил к модификатору?
ru_uk: Чому у БЕМ не рекомендується використовувати комбіновані селектори для створення CSS-правил до модификатору?

source: Комбинированные селекторы усложняют переопределение блока, так как имеют более высокую специфичность в CSS, чем одиночные.
ru_uk: Об'єднані селектори ускладнюють перевизначення блоку, оскільки мають більш високу специфічність у CSS, ніж поодинокі.

source: Специфичность комбинированного селектора для модификатора блока (`.block1.mod`) и для переопределенного блока (`.block2 .block1`) одинакова.
ru_uk: Специфічність комбінованого селектора модифікатора блоку (`.block1.mod`) і для переопределенного блоку (`.block2 .block1`) однакова.

source: Переопределение блока будет зависеть только от порядка объявления правил в декларации.
ru_uk: Перевизначення блоку буде залежати тільки від порядку оголошення правил у декларації.

source: Рассмотрим пример:
ru_uk: Розглянемо приклад:

source: Правила модификатора `active` для кнопки записываются как комбинированный селектор `.button.active`.
ru_uk: Правила модифікатора `active` для кнопки записуються як комбінований селектор `.button.active`.

source: При переопределении кнопки с помощью родительского блока `header`, создается селектор `.header .button`.
ru_uk: При перевизначенні кнопки з допомогою батьківського блоку `header`, створюється селектор `.header .button`.

source: Специфичность обоих селекторов одинакова, значит применение CSS-правил определяется порядком их объявления в декларации.
ru_uk: Специфічність обох селекторів однакова, значить застосування CSS-правил визначається порядком їх оголошення в декларації.

source: Использование имени блока в названии модификатора обеспечивает более высокий приоритет CSS-правилам при переопределении блока.
ru_uk: Використання імені блоку в назві модифікатора забезпечує більш високий пріоритет CSS-правил при перевизначенні блоку.

source: Селектор `.header .button` всегда будет иметь приоритет выше, чем `.button_active`.
ru_uk: Селектор `.header .button` завжди буде мати пріоритет вище, ніж `.button_active`.

source: [Причины использования имени блока в имени модификатора](#Зачем-писать-имя-блока-в-именах-модификаторов-и-элементов)
ru_uk: [Причини використання імені блоку імені модифікатора](#Навіщо писати-ім'я-блоку в іменах-модифікаторів-і-елементів)

source: Можно ли объединять тег и класс в селекторе?
ru_uk: Можна об'єднувати тег і клас в селекторі?

source: Например, button.button.
ru_uk: Наприклад, button.button.

source: Совмещение тега и класса в селекторе повышает специфичность CSS-правил.
ru_uk: Поєднання тега і класу в селекторі підвищує специфічність CSS-правил.

source: При добавлении модификатора правила блока не смогут быть переопределены, так как специфичность селектора блока выше.
ru_uk: При додаванні модифікатора правила блоку не зможуть бути перевизначені, так як специфічність селектора блоку вище.

source: Рассмотрим пример:
ru_uk: Розглянемо приклад:

source: Записываем для него CSS-правила в селекторе `button.button`.
ru_uk: Записуємо для нього CSS-правила в селекторі `button.button`.

source: Добавим модификатор:
ru_uk: Додамо модифікатор:

source: Cелектор `.button_active` не переопределит свойства блока, записанные как `button.button`, так как специфичность `button.button` выше.
ru_uk: Селектор `.button_active` не перевизначити властивості блоку, записані як `button.button`, так як специфічність `button.button` вище.

source: Для успешного переопределения селектор модификатора блока также должен быть скомбинирован с тегом `button.button_active`.
ru_uk: Для успішного перевизначення селектор модифікатора блоку також повинен бути скомбінований з тегом `button.button_active`.

source: В результате развития проекта могут появится блоки с селекторами `input.button`, `span.button` и, например, `a.button`.
ru_uk: В результаті розвитку проекту можуть з'явиться блоки з селекторами `input.button`, `span.button` і, наприклад, `a.button`.

source: В таком случае все модификаторы блока `button` и вложенные в него элементы потребуют четыре разные декларации для каждого случая.
ru_uk: У такому разі всі модифікатори блоку `button` і вкладені в нього елементи зажадають чотири різні декларації для кожного випадку.

source: Почему в БЭМ не используют пользовательские теги (custom tags) для блоков?
ru_uk: Чому у БЕМ не використовують користувальницькі теги (custom tags) для блоків?

source: Блоки могут выражаться в HTML с помощью пользовательских тегов, к которым создаются CSS-правила.
ru_uk: Блоки можуть виражатися в HTML з допомогою користувацьких тегів, до яких створюються CSS-правила.

source: В таком случае классы можно будет использовать только для модификаторов: `<button class="mod"/>`.
ru_uk: У такому разі класи можна буде використовувати тільки для модифікаторів: `<button class="mod"/>`.

source: Пользовательские теги могут применяться для создания селекторов к блокам, но есть ряд ограничений:
ru_uk: Користувальницькі теги можуть застосовуватися для створення селекторів до блокам, але є ряд обмежень:

source: Невозможно использовать [миксы](../method/key-concepts/key-concepts.ru.md#Микс).
ru_uk: Неможливо використовувати [мікси](../method/key-concepts/key-concepts.ru.md#Мікс).

source: Не любой блок можно выразить пользовательским тегом.
ru_uk: Не будь блок можна виразити користувальницьким тегом.

source: Например, для всех ссылок необходим тег `<a>`, а для полей — `<input>`.
ru_uk: Наприклад, для всіх посилань необхідний тег `<a>`, а для полів — `<input>`.

source: Почему нельзя делать общий сброс стилей (reset)?
ru_uk: Чому не можна робити загальний скид стилів (reset)?

source: Блок — независимый компонент.
ru_uk: Блок — незалежний компонент.

source: На него не должны влиять CSS-правила, созданные для всей страницы.
ru_uk: На нього не повинні впливати CSS-правила, створені для всієї сторінки.

source: Это нарушает независимость блоков и затрудняет их повторное использование.
ru_uk: Це порушує незалежність блоків і ускладнює їх повторне використання.

source: Общий сброс стилей по сути реализуется с помощью [глобальных CSS-правил](#Как-сделать-глобальные-модификаторы-для-блоков), которые в большинстве случаев пишутся к [селекторам на тег](#Почему-в-БЭМ-не-используют-пользовательские-теги-custom-tags-для-блоков), что нежелательно использовать в БЭМ-проекте.
ru_uk: Загальний скид стилів по суті реалізується з допомогою [глобальних CSS-правил](#Як зробити-глобальні-модифікатори-для-блоків), які в більшості випадків пишуться [селекторам на тег](#Чому-у-БЕМ-не-використовують-користувальницькі теги-custom-tags-для-блоків), що небажано використовувати в БЕМ-проекті.

source: Если сбросить стили все-таки необходимо, в БЭМ это делается в каждом блоке.
ru_uk: Якщо скинути стилі все-таки необхідно, БЕМ це робиться в кожному блоці.

source: Рассмотрим пример.
ru_uk: Розглянемо приклад.

source: Если в проекте блоки меню и список выражены в HTML с помощью тега `<ul>`, значит каждый блок должен предоставлять сброс CSS для `<ul>`.
ru_uk: Якщо в проекті блоки меню і список виражені в HTML з допомогою тегу `<ul>`, значить кожен блок повинен надавати скидання CSS `<ul>`.

source: Повторов в результирующем коде можно избежать с помощью CSS-оптимизатора.
ru_uk: Повторів у виводі коді можна уникнути за допомогою CSS-оптимізатора.

source: Если в проекте не используется CSS-оптимизатор, который объединяет селекторы с одинаковым набором правил, можно применить CSS-препроцессор.
ru_uk: Якщо в проекті не використовується CSS-оптимізатор, який об'єднує селектори з однаковим набором правил, можна застосувати CSS-препроцесор.

source: Тогда для каждого нового блока можно делать сброс правил, [миксуя](../method/key-concepts/key-concepts.ru.md#Микс) чистый код.
ru_uk: Тоді для кожного нового блоку можна робити скидання правил, [міксуючи](../method/key-concepts/key-concepts.ru.md#Мікс) чистий код.

source: Например, в SASS это будет выглядеть так:
ru_uk: Наприклад, в SASS це буде виглядати так:

source: Такой способ следует использовать только при отсутствии оптимизатора.
ru_uk: Такий спосіб слід використовувати тільки при відсутності оптимізатора.

source: Почему нельзя писать block_mod вместо block block_mod, если имя модификатора уже содержит всю информацию о блоке?
ru_uk: Чому не можна писати block_mod замість block block_mod, якщо ім'я модифікатора вже містить всю інформацію про блоці?

source: Совмещение нескольких модификаторов на одном и том же блоке (например, `<div class="block_theme_christmas block_size_big">`) приведет к дублированию кода, реализующего базовую функциональность (логику и стили) блока.
ru_uk: Поєднання декількох модифікаторів на одному і тому ж блоці (наприклад, `<div class="block_theme_christmas block_size_big">`) призведе до дублювання коду, що реалізує базову функціональність (логіку і стилі) блоку.

source: Почему нельзя указывать название CSS-свойства в имени модификатора: .block__element_border-color_grey?
ru_uk: Чому не можна вказувати назву CSS-властивості в імені модифікатора: .block__element_border-color_grey?

source: При изменении внешнего вида блока или элемента придется менять не только CSS-код, но и названия селекторов.
ru_uk: При зміні зовнішнього вигляду блоку або елемента доведеться міняти не тільки CSS-код, але і назви селекторів.

source: Например, если цвет границы изменится с серого (`grey`) на красный (`red`), нужно будет изменить шаблоны и, вполне вероятно, JavaScript-код.
ru_uk: Наприклад, якщо колір кордону зміниться з сірого (`grey`) на червоний (`red`), потрібно буде змінити шаблони і, цілком ймовірно, JavaScript-код.

source: При добавлении других свойств (фона, отступов), имя перестанет соответствовать содержанию модификатора.
ru_uk: При додаванні інших властивостей (фону, відступів), ім'я перестане відповідати вмісту модифікатора.

source: Методология БЭМ рекомендует выбирать имена модификаторов, опираясь на семантику, а не визуальное оформление.
ru_uk: Методологія БЕМ рекомендує вибирати імена модифікаторів, спираючись на семантику, а не візуальне оформлення.
