Repository: OleksandraP/translation
Catalog: methodology/bem-for-js/bem-for-js.*.xlf
Languages: ru_uk

source: JavaScript по БЭМ
ru_uk: JavaScript по БЕМ

source: В БЭМ-методологии JavaScript используется для «оживления» веб-страницы и рассматривается как одна из [технологий реализации](../key-concepts/key-concepts.ru.md#Технология-реализации) блока.
ru_uk: У БЕМ-методології JavaScript використовується для «пожвавлення» веб-сторінки і розглядається як одна з [технологій реалізації](../key-concepts/key-concepts.ru.md#Технологія-реалізації) блоку.

source: В БЭМ к JavaScript применяются [дополнительные правила](../bem-js-principles/bem-js-principles.ru.md), которые позволяют реализовать все идеи компонентного подхода БЭМ-методологии.
ru_uk: У БЕМ до JavaScript застосовуються [додаткові правила](../bem-js-principles/bem-js-principles.ru.md), які дозволяють реалізувати всі ідеї компонентного підходу БЕМ-методології.

source: Основные принципы компонентного подхода в JavaScript по БЭМ
ru_uk: Основні принципи компонентного підходу в JavaScript по БЕМ

source: JavaScript — это одна из технологий реализации блока, поэтому в работе с JavaScript могут соблюдаться основные идеи БЭМ-методологии:
ru_uk: JavaScript — це одна з технологій реалізації блоку, тому в роботі з JavaScript можуть дотримуватися основні ідеї БЕМ-методології:

source: [Единая предметная область](#Единая-предметная-область) — использование блоков, элементов и модификаторов, названных по общим [правилам именования](../naming-convention/naming-convention.ru.md).
ru_uk: [Єдина предметна область](#Єдина-предметна-область) — використання блоків, елементів і модифікаторів, названих за загальним [правилами іменування](../naming-convention/naming-convention.ru.md).

source: [Разделение кода на части](#Разделение-кода-на-части) и одинаковые [правила организации файловой структуры БЭМ-проекта](../filesystem/filesystem.ru.md).
ru_uk: [Поділ коду на частини](#Поділ-коду на частини) і однакові [правила організації файлової структури БЕМ-проекту](../filesystem/filesystem.ru.md).

source: [Разделение кода по уровням переопределения и использование сборки](#Работа-с-уровнями-переопределения).
ru_uk: [Поділ коду за рівнями перевизначення і використання збірки](#Робота з рівнями-перевизначення).

source: Единая предметная область
ru_uk: Єдина предметна область

source: В веб-разработке финальный продукт (например, веб-страница) состоит из разных технологий (HTML, CSS, JS и т.д.).
ru_uk: У веб-розробці фінальний продукт (наприклад, веб-сторінка) складається з різних технологій (HTML, CSS, JS і т. д.).

source: В БЭМ для работы во всех технологиях используются единые термины и подходы к реализации.
ru_uk: У БЕМ для роботи у всіх технологіях використовуються єдині терміни та підходи до реалізації.

source: Таким образом вся команда БЭМ-проекта получает единый язык для общения, то есть работает в терминах блоков, элементов и модификаторов.
ru_uk: Таким чином вся команда БЕМ-проекту отримує єдиний мову для спілкування, тобто працює в термінах блоків, елементів і модифікаторів.

source: Так, JavaScript-реализация блоков не оперирует понятиями DOM-элементов, а использует следующий уровень абстракции — [БЭМ-дерево](../key-concepts/key-concepts.ru.md#БЭМ-дерево).
ru_uk: Так, JavaScript-реалізація блоків не оперує поняттями DOM-елементів, а використовує наступний рівень абстракції — [БЕМ-дерево](../key-concepts/key-concepts.ru.md#БЕМ-дерево).

source: Это позволяет не опираться на классы, а независимо описывать поведение блоков и их опциональных элементов.
ru_uk: Це дозволяє не спиратися на класи, а незалежно описувати поведінку блоків та їх опціональних елементів.

source: Модификаторы в JavaScript используются для выражения логики работы блока или элемента (по аналогии с CSS, где с помощью модификаторов задается внешний вид).
ru_uk: Модифікатори JavaScript використовуються для вираження логіки роботи блоку або елемента (за аналогією з CSS, де з допомогою модифікаторів задається зовнішній вигляд).

source: Поведение блоков и элементов описывается в JavaScript как набор состояний.
ru_uk: Поведінка блоків і елементів описується в JavaScript як набір станів.

source: Применение единых понятий во всех технологиях позволяет реализовать в JavaScript различные хелперы для работы с компонентами и отказаться от жесткого кодирования имен блоков и разделителей.
ru_uk: Застосування єдиних понять у всіх технологіях дозволяє реалізувати в JavaScript різні хелпери для роботи з компонентами і відмовитися від жорсткого кодування імен блоків і роздільників.

source: Такой подход дает возможность, например, найти внутри блока все элементы с определенным именем и выставить им модификатор, проверить его значение.
ru_uk: Такий підхід дає можливість, наприклад, знайти всередині блоку всі елементи з певним ім'ям і виставити їм модифікатор, перевірити його значення.

source: **Пример**
ru_uk: **Приклад**

source: Рассмотрим пример всплывающего окна (`popup`).
ru_uk: Розглянемо приклад спливаючого вікна (`popup`).

source: Показывать всплывающее окно можно различными способами:
ru_uk: Показувати спливаюче вікно можна різними способами:

source: Воспользоваться распространенным решением и добавлять соответствующий класс.
ru_uk: Скористатися поширеним рішенням і додавати відповідний клас.

source: Такой способ не всегда удобен, так как необходимо жестко прописывать имя блока в коде.
ru_uk: Такий спосіб не завжди зручний, так як необхідно жорстко прописувати ім'я блоку в коді.

source: Воспользоваться принципами БЭМ и оперировать не классами, а блоками, элементами и модификаторами.
ru_uk: Скористатися принципами БЕМ і оперувати не класами, а блоками, елементами та модифікаторами.

source: В таком случае поиск компонента выполняется не по классу, а по имени блока, который в проекте может выражаться не только классом, но и тегом, атрибутом и т.д.
ru_uk: У такому випадку пошук компонента виконується не по класу, а по імені блоку, який у проекті може виражатися не тільки класом, але і тегом, атрибутом і т. д.

source: Отображение всплывающего окна (перевод блока `popup` в состояние `visible`) также осуществляется не по классу, а с помощью модификатора.
ru_uk: Відображення спливаючого вікна (переклад блоку `popup` стан `visible`) також здійснюється не по класу, а з допомогою модифікатора.

source: **Обратите внимание!** Для примеров, написанных по БЭМ-методологии, используется псевдокод.
ru_uk: **Зверніть увагу!** Для прикладів, написаних за БЕМ-методології, що використовується псевдокод.

source: Реальные примеры реализации представлены в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/v2/i-bem-js/).
ru_uk: Реальні приклади реалізації представлені у документації до [i-bem.js](https://ru.bem.info/technology/i-bem/v2/i-bem-js/).

source: Использование единой предметной области дает возможность на более высоком уровне взаимодействовать с компонентами.
ru_uk: Використання єдиної предметної області дає можливість на більш високому рівні взаємодіяти з компонентами.

source: Работа с модификаторами
ru_uk: Робота з модифікаторами

source: Модификаторы могут задавать блокам определенные состояния.
ru_uk: Модифікатори можуть задавати блокам певні стани.

source: Логика работы блока реализуется в JavaScript и описывается с помощью состояний.
ru_uk: Логіка роботи блоку реалізується в JavaScript і описується за допомогою станів.

source: Перевод блока в другое состояние может производиться при помощи установки/снятия модификатора.
ru_uk: Переклад блоку в інший стан може проводитися за допомогою установки/зняття модифікатора.

source: Изменение модификатора создает событие, которое можно использовать для работы с блоком.
ru_uk: Зміна модифікатора створює подія, яку можна використовувати для роботи з блоком.

source: Например, чтобы отметить чекбокс, блоку `checkbox` нужно установить модификатор `checked` в значение `true`.
ru_uk: Наприклад, щоб відзначити чекбокс, блоку `checkbox` потрібно встановити модифікатор `checked` значення `true`.

source: В БЭМ-проекте нельзя изменять состояния в режиме runtime с помощью модификатора, напрямую меняя CSS-класс на соответствующем DOM-узле.
ru_uk: У БЕМ-проекті не можна змінювати стану в режимі runtime з допомогою модифікатора, безпосередньо змінюючи CSS-клас на відповідному DOM-сайті.

source: Для корректной работы JavaScript все манипуляции с модификаторами должны производиться при помощи методов-хелперов.
ru_uk: Для коректної роботи JavaScript всі маніпуляції з модифікаторами повинні проводитися за допомогою методів-хелперів.

source: Примеры реализации доступны в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-mods/).
ru_uk: Приклади реалізації доступні в документації до [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-mods/).

source: Реакция на изменение модификаторов
ru_uk: Реакція на зміну модифікаторів

source: Переход блока из одного состояния в другое часто вызывает изменения в его внешнем виде.
ru_uk: Перехід блоку з одного стану в інший часто викликає зміни в його зовнішньому вигляді.

source: Если в CSS внешний вид блока задается с помощью модификатора, то изменение состояния блока, вызванное тем же модификатором, автоматически применит все необходимые стили.
ru_uk: Якщо в CSS зовнішній вигляд блоку задається з допомогою модифікатора, то зміна стану блоку, викликане тим же модифікатором, автоматично застосує всі необхідні стилі.

source: В БЭМ реакция на установку/снятие модификатора описывается [декларативно](../bem-js-principles/bem-js-principles.ru.md#Декларативный-стиль).
ru_uk: У БЕМ реакція на встановлення/зняття модифікатора описується [декларативно](../bem-js-principles/bem-js-principles.ru.md#Декларативний-стиль).

source: Так, например, если в CSS во время исполнения появляется какой-то дополнительный класс (модификатор), то все свойства этого модификатора автоматически применяются к DOM-узлу, на который этот класс установлен.
ru_uk: Так, наприклад, якщо в CSS під час виконання з'являється якийсь додатковий клас (модифікатор), то всі властивості цього модифікатора автоматично застосовуються до DOM-вузла, на який цей клас встановлений.

source: В JavaScript происходит то же самое: если появляется модификатор (добавляется новый класс к DOM-узлу), то вся функциональность, свойственная этому модификатору, применяется.
ru_uk: В JavaScript відбувається те ж саме: якщо з'являється модифікатор (додається новий клас до DOM-сайту), то вся функціональність, властива цьому модификатору, що застосовується.

source: Если модификатор исчезает, функциональность отключается.
ru_uk: Якщо модифікатор зникає, функціональність відключається.

source: Чтобы динамически изменять состояния блоков и элементов, используются специальные методы для установки и снятия модификаторов.
ru_uk: Щоб динамічно змінювати стану блоків і елементів, використовуються спеціальні методи для встановлення і зняття модифікаторів.

source: Примеры реализации доступны в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/v2/i-bem-js-mods/).
ru_uk: Приклади реалізації доступні в документації до [i-bem.js](https://ru.bem.info/technology/i-bem/v2/i-bem-js-mods/).

source: **Пример**
ru_uk: **Приклад**

source: Рассмотрим форму отправки сообщения.
ru_uk: Розглянемо форму відправлення повідомлення.

source: Должно выполняться условие: если введен неправильный email, кнопка отправки (блок `button`) становится недоступна (получает модификатор `button_disabled`).
ru_uk: Повинно виконуватися умова: якщо введений неправильний email, кнопка відправки (блок `button`) стає недоступною (отримує модифікатор `button_disabled`).

source: Можно жестко прописать все условия в коде и постоянно выполнять проверку.
ru_uk: Можна жорстко прописати всі умови в коді і постійно виконувати перевірку.

source: Такой подход не удобен, так как любое изменение потребует изменений в коде вручную.
ru_uk: Такий підхід не зручний, так як будь-яка зміна вимагає змін у коді вручну.

source: Можно задекларировать поведение блока и получить возможность перекрывать каждый модификатор отдельно на новом уровне переопределения.
ru_uk: Можна задекларувати поведінка блоку і отримати можливість перекривати кожен модифікатор окремо на новому рівні перевизначення.

source: В [декларации](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/) можно указать, как блок или элемент должен отреагировать на изменение модификатора.
ru_uk: В [декларації](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/) можна вказати, як блок або елемент повинен відреагувати на зміну модифікатора.

source: Такой подход дает возможность:
ru_uk: Такий підхід дає можливість:

source: Реагировать на модификатор независимо от способа его установки/снятия (через JavaScript API: `block('button').setMod('focused')` или пользователь установил/снял фокус курсором).
ru_uk: Реагувати на модифікатор незалежно від способу його установки/зняття (через JavaScript API: `block('button').setMod('focused')` або користувач встановив/зняв фокус курсором).

source: Определять каждому состоянию свой внешний вид, добавив стили модификатору.
ru_uk: Визначати кожному станом свій зовнішній вигляд, додавши стилі модификатору.

source: Изменять или полностью перекрывать поведение блока с помощью [уровней переопределения](#Работа-с-уровнями-переопределения).
ru_uk: Змінювати або повністю перекривати поведінка блоку з допомогою [рівнів перевизначення](#Робота з рівнями-перевизначення).

source: Разделение кода на части
ru_uk: Поділ на частини коду

source: К JavaScript могут применяться основные принципы организации и хранения кода по БЭМ-методологии:
ru_uk: До JavaScript можуть застосовуватись основні принципи організації і зберігання коду за БЕМ-методології:

source: разделение кода на отдельные части — логика работы каждого блока, его опциональных элементов и модификаторов описывается в отдельных файлах;
ru_uk: поділ коду на окремі частини — логіка роботи кожного блоку, його опціональних елементів і модифікаторів описується в окремих файлах;

source: JavaScript-файлы для каждого компонента хранятся в соответствии с [правилами организации файловой структуры](../filesystem/filesystem.ru.md) БЭМ-проекта.
ru_uk: JavaScript-файли для кожного компонента зберігаються відповідно до [правилами організації файлової структури](../filesystem/filesystem.ru.md) БЕМ-проекту.

source: **Пример**
ru_uk: **Приклад**

source: Рассмотрим пример логотипа (блок `logo`), реализованного в двух технологиях: шаблоне и стилях.
ru_uk: Розглянемо приклад логотипу (блок `logo`), реалізованого в двох технологіях: шаблоні і стилях.

source: HTML-реализация блока:
ru_uk: HTML-реалізація блоку:

source: <a class="logo" href="/">Ваша крутая компания</a>
ru_uk: <a class="logo" href="/">Ваша крута компанія</a>

source: CSS-реализация блока:
ru_uk: CSS-реалізація блоку:

source: Блок `logo` в файловой структуре проекта:
ru_uk: Блок `logo` у файловій структурі проекту:

source: logo/ logo.css # Внешний вид блока logo.tmpl # Шаблоны для генерации HTML-представления блока
ru_uk: logo/ logo.css # Зовнішній вигляд блоку logo.tmpl # Шаблони для генерації HTML-представлення блоку

source: Добавим блоку `logo` JavaScript-функциональность: теперь нажатие на логотип вызывает какое-то действие.
ru_uk: Додамо блоку `logo` JavaScript-функціональність: тепер натискання на логотип викликає якусь дію.

source: Согласно БЭМ-методологии новое поведение блока `logo` будет реализовано следующим образом:
ru_uk: Згідно БЕМ-методології нове поведінка блоку `logo` буде реалізовано наступним чином:

source: в отдельном файле;
ru_uk: в окремому файлі;

source: имя файла будет соответствовать имени блока с расширением `.js`;
ru_uk: назва файлу повинна відповідати імені блоку з розширенням `.js`;

source: файл `logo.js` будет находится в директории блока `logo/`.
ru_uk: файл `logo.js` буде знаходиться в директорії блоку `logo/`.

source: JavaScript-реализация блока:
ru_uk: JavaScript-реалізація блоку:

source: Файл `logo.js` в файловой структуре блока:
ru_uk: Файл `logo.js` у файловій структурі блоку:

source: logo/ logo.css # Внешний вид блока logo.tmpl # Шаблоны для генерации HTML-представления блока logo.js # Динамическое поведение блока в браузере
ru_uk: logo/ logo.css # Зовнішній вигляд блоку logo.tmpl # Шаблони для генерації HTML-представлення блоку logo.js # Динамічну поведінку блоку в браузері

source: Разделение кода на части и строгая организация файловой системы проекта позволяет не только облегчить навигацию по проекту и повторное использование или перенос компонентов, но и работать с уровнями переопределения для JavaScript и использовать сборку.
ru_uk: Поділ коду на частини і сувора організація файлової системи проекту дозволяє не тільки полегшити навігацію по проекту і повторне використання або перенесення компонентів, але і працювати з рівнями перевизначення для JavaScript і використовувати збірку.

source: Работа с уровнями переопределения
ru_uk: Робота з рівнями перевизначення

source: В описании БЭМ-методологии приведено [много примеров](../filesystem/filesystem.ru.md#Примеры-использования-уровней-переопределения), где конечная CSS-реализация блока собирается с разных уровней переопределения.
ru_uk: В описі БЕМ-методології приведено [багато прикладів](../filesystem/filesystem.ru.md#Приклади використання-рівнів-перевизначення), де кінцева CSS-реалізація блоку збирається з різних рівнів перевизначення.

source: Применение принципов БЭМ-методологии к JavaScript позволяет аналогичным образом разделять поведение блоков по разным уровням:
ru_uk: Застосування принципів БЕМ-методології до JavaScript дозволяє аналогічним чином розділяти поведінка блоків за різними рівнями:

source: реализовывать новую функциональность блока на другом уровне переопределения, сохраняя предыдущее поведение блока, наследовать и дополнять его (делать super call);
ru_uk: реалізовувати нову функціональність блоку на іншому рівні перевизначення, зберігаючи попереднє поведінка блоку, успадковувати і доповнювати його (робити super call);

source: полностью перекрывать поведение блока (переопределять);
ru_uk: повністю перекривати поведінка блоку (змінити);

source: добавлять новые блоки с новой функциональностью, которых не было на предыдущих уровнях.
ru_uk: додавати нові блоки з новою функціональністю, яких не було на попередніх рівнях.

source: С помощью уровней переопределения можно создать универсальную JavaScript-библиотеку блоков и изменять ее на проектном уровне.
ru_uk: З допомогою рівнів перевизначення можна створити універсальну JavaScript-бібліотеки блоків і змінювати її на проектному рівні.

source: Затем использовать сборку и включать в проект только необходимое поведение блоков.
ru_uk: Потім використовувати збірку і включати в проект тільки необхідну поведінку блоків.

source: **Пример**
ru_uk: **Приклад**

source: Вернемся к примеру формы отправки сообщения:
ru_uk: Повернемося до прикладу форми надсилання повідомлення:

source: Запись с стиле БЭМ позволяет:
ru_uk: Запис у стилі БЕМ дозволяє:

source: Полностью перекрывать поведение блока на другом уровне переопределения.
ru_uk: Повністю перекривати поведінка блоку на іншому рівні перевизначення.

source: Добавлять или частично изменять поведение блока на другом уровне переопределения.
ru_uk: Додавати або частково змінювати поведінку блоку на іншому рівні перевизначення.

source: Для работы с уровнями переопределения в БЭМ можно использовать специализированный фреймворк, например, [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js/), так как он создан по требованиям БЭМ-методологии.
ru_uk: Для роботи з рівнями перевизначення БЕМ можна використовувати спеціалізований фреймворк, наприклад, [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js/), так як він створений за вимогами БЕМ-методології.

source: Как перейти на JavaScript по БЭМ
ru_uk: Як перейти на JavaScript з БЕМ

source: Самый быстрый путь — начать применять принципы БЭМ-методологии в своем проекте и получать первые результаты без использования специализированного фреймворка.
ru_uk: Найшвидший шлях — почати застосовувати принципи БЕМ-методології в своєму проекті і отримувати перші результати без використання спеціалізованого фреймворка.

source: Как это сделать на практике показано в статье [БЭМ — это не только про CSS](https://ru.bem.info/forum/163/) с примерами на jQuery.
ru_uk: Як це зробити на практиці показано в статті [БЕМ — це не тільки про CSS](https://ru.bem.info/forum/163/) з прикладами на jQuery.

source: Чтобы реализовать сразу все идеи БЭМ в вашем проекте, необходимо использовать фреймворк [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js/):
ru_uk: Щоб реалізувати всі ідеї БЕМ у вашому проекті, необхідно використовувати фреймворк [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js/):

source: работать в [единых терминах](#Единая-предметная-область) блоков, элементов и модификаторов во всех технологиях;
ru_uk: працювати у [єдиних термінах](#Єдина-предметна область) блоків, елементів і модифікаторів у всіх технологіях;

source: создавать независимые компоненты — блоки — на уровне JavaScript;
ru_uk: створювати незалежні компоненти — блоки — на рівні JavaScript;

source: изменять поведение блоков, элементов и модификаторов с помощью уровней переопределения по аналогии с CSS;
ru_uk: змінювати поведінку блоків, елементів і модифікаторів з допомогою рівнів перевизначення за аналогією з CSS;

source: повторно использовать блоки, переносить их между проектами;
ru_uk: повторно використовувати блоки, переносити їх між проектами;

source: облегчить и ускорить разработку и отладку проекта за счет несвязанности компонентов и возможности разрабатывать поблочно;
ru_uk: полегшити і прискорити розробку і налагодження проекту за рахунок незв'язаності компонентів і можливості розробляти поблочно;

source: включать в сборку только нужную JavaScript-реализацию блока;
ru_uk: включати в збірку тільки потрібну JavaScript-реалізацію блоку;

source: облегчить навигацию по файловой структуре проекта.
ru_uk: полегшити навігацію по файловій структурі проекту.
