Repository: OleksandraP/translation
Catalog: methodology/naming-convention/naming-convention.*.xlf
Languages: ru_uk

source: Соглашение по именованию
ru_uk: Угода щодо іменування

source: Для работы с [БЭМ-сущностями](../key-concepts/key-concepts.ru.md#БЭМ-сущность) необходимо ознакомиться с правилами их именования.
ru_uk: Для роботи з [БЕМ-сутностями](../key-concepts/key-concepts.ru.md#БЕМ-сутність) необхідно ознайомитися з правилами їх іменування.

source: Основная идея соглашения по именованию — сделать имена CSS-селекторов максимально информативными и понятными.
ru_uk: Основна ідея угоди щодо іменування — зробити імена CSS селекторів максимально інформативними і зрозумілими.

source: Это поможет [упростить разработку](../solved-problems/solved-problems.ru.md#Как-упростить-код-и-облегчить-рефакторинг) и [отладку](../solved-problems/solved-problems.ru.md#Как-начать-повторно-использовать-код-и-избежать-взаимного-влияния-компонентов-друг-на-друга) кода, а также решить некоторые [проблемы](../solved-problems/solved-problems.ru.md#Как-получить-самодокументируемый-код) веб-разработчиков.
ru_uk: Це допоможе [спростити розробку](../solved-problems/solved-problems.ru.md#Як-спростити-код-і-полегшити-рефакторинг) і [отладку](../solved-problems/solved-problems.ru.md#Как-начать-повторно-использовать-код-и-избежать-взаимного-влияния-компонентов-друг-на-друга) коду, а також вирішити деякі [проблеми](../solved-problems/solved-problems.ru.md#Як-отримати-самодокументируемый-код) веб-розробників.

source: В качестве примера рассмотрим CSS-селектор `menuitemvisible`.
ru_uk: В якості прикладу розглянемо CSS-селектор `menuitemvisible`.

source: Быстрый просмотр такой записи не дает возможности определить типы БЭМ-сущностей по имени.
ru_uk: Швидкий перегляд такого запису не дає можливості визначити типи БЕМ-сутностей по імені.

source: Добавим разделитель:
ru_uk: Додамо роздільник:

source: `menu-item-visible` или `menuItemVisible`
ru_uk: `menu-item-visible` або `menuItemVisible`

source: В таком виде имя селектора явно разделяется на логические части.
ru_uk: У такому вигляді ім'я селектора явно поділяється на логічні частини.

source: Можем предположить, что `menu` окажется блоком, `item` — элементом, а `visible` — модификатором.
ru_uk: Можемо припустити, що `menu` виявиться блоком, `item` — елементом, а `visible` — модифікатором.

source: Однако в реальной жизни часто возникают более сложные и не столь однозначные случаи, решить которые помогает соглашение по именованию БЭМ.
ru_uk: Однак у реальному житті часто виникають більш складні і не настільки однозначні випадки, вирішити які допомагає угоду щодо іменування БЕМ.

source: БЭМ-методология предоставляет идею по созданию правил формирования имен и свой способ ее реализации — [соглашение по именованию CSS-селекторов](#Соглашение-по-именованию-css-селекторов).
ru_uk: БЕМ-методологія надає ідею по створенню правил формування імен і свій спосіб її реалізації — [угода щодо іменування CSS селекторів](#Угода-по-іменування-css селекторів).

source: Однако в мире веб-разработки существует ряд [альтернативных схем](#Альтернативные-схемы-именования), основанных на принципах БЭМ.
ru_uk: Однак у світі веб-розробки існує ряд [альтернативних схем](#Альтернативні схеми-іменування), заснованих на принципах БЕМ.

source: Соглашение по именованию CSS-селекторов
ru_uk: Угода щодо іменування CSS селекторів

source: Имена БЭМ-сущностей записываются с помощью **цифр** и **латинских букв** в **нижнем регистре**.
ru_uk: Імена БЕМ-сутностей записуються з допомогою **цифр** і **латинських літер** **нижньому регістрі**.

source: Для разделения слов в именах используется **дефис** (`-`).
ru_uk: Для розділення слів в іменах використовується **дефіс** (`-`).

source: Для хранения информации об именах блоков, элементов и модификаторов используются **CSS-классы**.
ru_uk: Для зберігання інформації про імена блоків, елементів і модифікаторів використовуються **CSS-класи**.

source: Правила формирования имен:
ru_uk: Правила формування імен:

source: [блоков](#Имя-блока)
ru_uk: [блоків](#Ім'я-блоку)

source: [элементов](#Имя-элемента)
ru_uk: [елементів](#Ім'я елемента)

source: [модификаторов](#Имя-модификатора)
ru_uk: [модифікаторів](#Ім'я-модифікатора)

source: Имя блока
ru_uk: Ім'я блоку

source: Имя блока формируется по схеме `block-name` и задает [пространство имен](https://ru.wikipedia.org/wiki/Пространство_имён) для элементов и модификаторов.
ru_uk: Ім'я блоку формується за схемою `block-name` і задає [простір імен](https://ru.wikipedia.org/wiki/Пространство_имен) елементів і модифікаторів.

source: Иногда к именам блоков могут добавляться различные префиксы.
ru_uk: Іноді до імен блоків можуть додаватися різні префікси.

source: Подробнее о нашем опыте использования префиксов рассказывается в статье [История создания БЭМ](https://ru.bem.info/method/history/#Появление-блоков).
ru_uk: Детальніше про наш досвід використання префіксів розповідається в статті [Історія створення БЕМ](https://ru.bem.info/method/history/#Появление-блоков).

source: **Пример**
ru_uk: **Приклад**

source: Имя элемента
ru_uk: Ім'я елемента

source: Пространство имен, заданное именем блока, определяет принадлежность элемента к данному блоку.
ru_uk: Простір імен, заданий ім'ям блоку, визначає належність елемента до цього блоку.

source: Имя элемента отделяется от имени блока двумя подчеркиваниями (`__`).
ru_uk: Ім'я елемента відокремлюється від імені блоку двома підкресленнями (`__`).

source: Полное имя элемента создается по схеме:
ru_uk: Повне ім'я елемента створюється за схемою:

source: Если блок имеет несколько одинаковых элементов, как в случае пунктов меню, то все они будут иметь одинаковые имена `menu__item`.
ru_uk: Якщо блок має кілька однакових елементів, як у випадку пунктів меню, то всі вони будуть мати однакові імена `menu__item`.

source: **Важно!** В методологии БЭМ [не существует элементов элементов](../../faq/faq.ru.md#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2).
ru_uk: **Важливо!** У методології БЕМ [не існує елементів элементов](../../faq/faq.ru.md#Почему-в-БЭМ-не-рекомендуется-создавать-элементы-элементов-block__elem1__elem2).

source: **Пример**
ru_uk: **Приклад**

source: Имя модификатора
ru_uk: Ім'я модифікатора

source: Пространство имен, заданное именем блока, определяет принадлежность модификатора к данному блоку или его элементу.
ru_uk: Простір імен, заданий ім'ям блоку, визначає приналежність модифікатора до цього блоку або його елементу.

source: Имя модификатора отделяется от имени блока или элемента одним подчеркиванием (`_`).
ru_uk: Ім'я модифікатора відокремлюється від імені блоку або елемента одним підкресленням (`_`).

source: Полное имя модификатора создается по схеме:
ru_uk: Повне ім'я модифікатора створюється за схемою:

source: Для булевых модификаторов — `owner-name_mod-name`.
ru_uk: Для булевої модифікаторів — `owner-name_mod-name`.

source: Для модификаторов вида «ключ-значение» — `owner-name_mod-name_mod-val`.
ru_uk: Для модифікаторів виду «ключ-значення» — `owner-name_mod-name_mod-val`.

source: **Важно!** В методологии БЭМ [модификатор не может использоваться в отрыве от своего владельца](../../faq/faq.ru.md#Зачем-писать-имя-блока-в-именах-модификаторов-и-элементов).
ru_uk: **Важливо!** У методології БЕМ [модифікатор не може використовуватися у відриві від свого власника](../../faq/faq.ru.md#Навіщо писати-ім'я-блоку в іменах-модифікаторів-і-елементів).

source: Модификатор блока
ru_uk: Модифікатор блоку

source: **Булевый модификатор**.
ru_uk: **Булевий модифікатор**.

source: Значение такого модификатора не указывается.
ru_uk: Значення такого модифікатора не вказується.

source: Полное имя создается по схеме:
ru_uk: Повне ім'я створюється за схемою:

source: **Пример**
ru_uk: **Приклад**

source: **Модификатор типа «ключ — значение»**.
ru_uk: **Модифікатор типу «ключ — значення»**.

source: Значение модификатора отделяется от имени одним подчеркиванием (`_`).
ru_uk: Значення модифікатора відокремлюється від імені одним підкресленням (`_`).

source: Полное имя создается по схеме:
ru_uk: Повне ім'я створюється за схемою:

source: **Пример**
ru_uk: **Приклад**

source: *Неверная форма записи*
ru_uk: *Неправильна форма запису*

source: В данном случае в записи отсутствует сам блок, на который влияет модификатор.
ru_uk: У даному випадку запис відсутній сам блок, на який впливає модифікатор.

source: Модификатор элемента
ru_uk: Модифікатор елемента

source: **Булевый модификатор**.
ru_uk: **Булевий модифікатор**.

source: Значение такого модификатора не указывается.
ru_uk: Значення такого модифікатора не вказується.

source: Полное имя создается по схеме:
ru_uk: Повне ім'я створюється за схемою:

source: **Пример**
ru_uk: **Приклад**

source: **Модификатор типа «ключ — значение»**.
ru_uk: **Модифікатор типу «ключ — значення»**.

source: Значение модификатора отделяется от имени одним подчеркиванием (`_`).
ru_uk: Значення модифікатора відокремлюється від імені одним підкресленням (`_`).

source: Полное имя создается по схеме:
ru_uk: Повне ім'я створюється за схемою:

source: **Пример**
ru_uk: **Приклад**

source: Пример использования соглашения по именованию
ru_uk: Приклад використання угоди щодо іменування

source: Реализация формы аутентификации в HTML и CSS:
ru_uk: Реалізація форми аутентифікації в HTML і CSS:

source: Альтернативные схемы именования
ru_uk: Альтернативні схеми іменування

source: Существуют альтернативные решения, основанные на соглашении по именованию БЭМ.
ru_uk: Існують альтернативні рішення, засновані на угоді по іменування БЕМ.

source: Стиль Гарри Робертса
ru_uk: Стиль Гаррі Робертса

source: Одним из первых, кто заговорил о БЭМ в англоязычном мире, был [Гарри Робертс](http://csswizardry.com/work/).
ru_uk: Одним з перших, хто заговорив про БЕМ в англомовному світі, був [Гаррі Робертс](http://csswizardry.com/work/).

source: В своей статье [MindBEMding – getting your head ’round BEM syntax](http://csswizardry.com/2013/01/mindbemding-getting-your-head-round-bem-syntax/) он рассказал о соглашении по именованию CSS-классов по БЭМ-методологии.
ru_uk: У своїй статті [MindBEMding–getting your head 'round BEM syntax](http://csswizardry.com/2013/01/mindbemding-getting-your-head-round-bem-syntax/) він розповів про угоду щодо іменування CSS-класів за БЕМ-методології.

source: Гарри Робертс предложил свою схему именования, основанную на принципах БЭМ:
ru_uk: Гаррі Робертс запропонував свою схему іменування, засновану на принципах БЕМ:

source: Имена записываются в нижнем регистре.
ru_uk: Імена записуються в нижньому регістрі.

source: Для разделения слов в именах БЭМ-сущностей используется дефис (`-`).
ru_uk: Для розділення слів в іменах БЕМ-сутностей використовується дефіс (`-`).

source: Имя элемента отделяется от имени блока с помощью двух подчеркиваний (`__`).
ru_uk: Ім'я елемента відокремлюється від імені блоку за допомогою двох підкреслень (`__`).

source: Булевые модификаторы отделяются с помощью двух дефисов (`--`).
ru_uk: Булеві модифікатори відокремлюються за допомогою двох дефісів (`--`).

source: Модификаторы вида «ключ-значение» не используются.
ru_uk: Модифікатори виду «ключ-значення» не використовуються.

source: Данный стиль отличается от классического использованием [CamelCase](https://ru.wikipedia.org/wiki/CamelCase) вместо дефиса для разделения слов в именах БЭМ-сущностей.
ru_uk: Цей стиль відрізняється від класичного використанням [CamelCase](https://ru.wikipedia.org/wiki/CamelCase замість дефіса для розділення слів в іменах БЕМ-сутностей.

source: Стиль без подчеркиваний
ru_uk: Стиль без підкреслень

source: Для записи имен используется CamelCase.
ru_uk: Для запису імен використовується CamelCase.

source: Имя элемента отделяется от имени блока с помощью одного дефиса (`-`).
ru_uk: Ім'я елемента відокремлюється від імені блоку з допомогою одного дефісу (`-`).

source: Для отделения модификатора используется два дефиса (`--`).
ru_uk: Для відділення модифікатора використовується два дефіса (`--`).

source: Значение модификатора отделяется от его имени с помощью двух дефисов (`--`).
ru_uk: Значення модифікатора відокремлюється від його імені з допомогою двох дефісів (`--`).

source: Основное отличие данного стиля в отсутствии имени блока и/или элемента перед модификатором.
ru_uk: Основна відмінність даного стилю у відсутності імені блоку та/або елемента перед модифікатором.

source: Такая схема накладывает ограничения на использование [миксов](../key-concepts/key-concepts.ru.md#Микс), так как не дает возможности определить, к какому блоку/элементу относится модификатор.
ru_uk: Така схема накладає обмеження на використання [міксів](../key-concepts/key-concepts.ru.md#Мікс), так як не дає можливості визначити, до якого блоку/елементу відноситься модифікатор.

source: Какой стиль выбрать
ru_uk: Який стиль вибрати

source: Методология БЭМ предлагает общие принципы именования БЭМ-сущностей.
ru_uk: Методологія БЕМ пропонує загальні принципи іменування БЕМ-сутностей.

source: Выбор схемы именования зависит от требований вашего проекта и личных предпочтений.
ru_uk: Вибір схеми іменування залежить від вимог вашого проекту та особистих уподобань.

source: Использование предложенного методологией [соглашения по именованию](#Соглашение-по-именованию-css-селекторов) имеет один существенный плюс — наличие готовых инструментов для разработки, которые ориентируются именно на «классическое именование».
ru_uk: Використання запропонованого методологією [угоди щодо іменування](#Угода-по-іменування-css селекторів) має один істотний плюс — наявність готових інструментів для розробки, які орієнтуються саме на «класичне іменування».

source: Помимо этого, БЭМ-методология не ограничивается использованием технологий HTML и CSS, рассмотренных в этом документе.
ru_uk: Крім цього, БЕМ-методологія не обмежується використанням технологій HTML і CSS, розглянутих у цьому документі.

source: Понятия блоков, элементов и модификаторов применяются при работе с JavaScript, шаблонами и файловой системой БЭМ-проекта.
ru_uk: Поняття блоків, елементів і модифікаторів застосовуються при роботі з JavaScript, шаблонами і файловою системою БЕМ-проекту.

source: Инструмент [bem-naming](https://ru.bem.info/tools/bem/bem-naming) позволяет применять одинаковые имена БЭМ-сущностей во всех используемых [технологиях реализации](../key-concepts/key-concepts.ru.md#Технология-реализации).
ru_uk: Інструмент [bem-naming](https://ru.bem.info/tools/bem/bem-naming) дозволяє застосовувати однакові імена БЕМ-сутностей у всіх використовуваних [технологіях реалізації](../key-concepts/key-concepts.ru.md#Технологія-реалізації).

source: По умолчанию `bem-naming` содержит настройки соглашения по именованию, предложенного методологией, но позволяет добавлять правила для использования альтернативных схем.
ru_uk: За замовчуванням `bem-naming` містить налаштування угоди щодо іменування, запропонованого методологією, але дозволяє додавати правила для використання альтернативних схем.
