Repository: OleksandraP/translation
Catalog: methodology/bem-js-principles/bem-js-principles.*.xlf
Languages: ru_uk

source: Особенности реализации JavaScript по БЭМ-методологии
ru_uk: Особливості реалізації JavaScript за БЕМ-методології

source: [Декларативный стиль](#Декларативный-стиль)
ru_uk: [Декларативний стиль](#Декларативний стиль)

source: [Принципы ООП в JavaScript по БЭМ](#Принципы-ООП-в-javascript-по-БЭМ)
ru_uk: [Принципи ООП в JavaScript по БЕМ](#Принципи ООП-в-javascript-БЕМ)

source: [Представление динамических блоков в DOM](#Представление-динамических-блоков-в-dom)
ru_uk: [Подання динамічних блоків в DOM](#Подання-динамічних-блоків-в-dom)

source: [Взаимодействие блоков](#Взаимодействие-блоков)
ru_uk: [Взаємодію блоків](#Взаємодія блоків)

source: [Взаимодействие блока с его элементами](#Взаимодействие-блока-с-его-элементами)
ru_uk: [Взаємодію блоку з його елементами](#Взаємодія-блоку з його елементами)

source: Декларативный стиль
ru_uk: Декларативний стиль

source: Декларативность JavaScript в БЭМ-проекте проявляется в следующем:
ru_uk: Декларативність JavaScript у БЕМ-проекті проявляється в наступному:

source: Поведение каждого блока описывается независимо.
ru_uk: Поведінка кожного блоку описується незалежно.

source: Состояния блока задаются декларативно.
ru_uk: Стану блоку задаються декларативно.

source: При [изменении состояний](#Реакция-на-изменение-модификаторов) автоматически вызывается код, который задекларирован для этого состояния.
ru_uk: При [зміну станів](#Реакція-на-зміна-модифікаторів) автоматично викликається код, який задекларований для цього стану.

source: Логика работы блока описывается как набор действий и условий, при которых эти действия необходимо выполнять.
ru_uk: Логіка роботи блоку описується як набір дій і умов, при яких ці дії необхідно виконувати.

source: Это позволяет разделять функциональность блока на отдельные части и использовать [уровни переопределения](../key-concepts/key-concepts.ru.md#Уровень-переопределения).
ru_uk: Це дозволяє розділяти функціональність блоку на окремі частини і використовувати [рівні перевизначення](../key-concepts/key-concepts.ru.md#Рівень-перевизначення).

source: [Подробнее о применении уровней переопределния в JavaScript](#Работа-с-уровнями-переопределения)
ru_uk: [Докладніше про застосування рівнів переопределния в JavaScript](#Робота з рівнями-перевизначення)

source: Принципы ООП в JavaScript по БЭМ
ru_uk: Принципи ООП в JavaScript по БЕМ

source: В БЭМ-методологии к JavaScript применяются основные принципы объектно-ориентированного программирования (ООП).
ru_uk: У БЕМ-методології до JavaScript застосовуються основні принципи об'єктно-орієнтованого програмування (ООП).

source: Инкапсуляция
ru_uk: Інкапсуляція

source: В БЭМ JavaScript-реализация одного блока отделена от другого.
ru_uk: У БЕМ JavaScript-реалізація одного блоку відокремлена від іншого.

source: Каждый блок предоставляет API для [взаимодействия с другими блоками](#Взаимодействие-блоков).
ru_uk: Кожен блок надає API для [взаємодії з іншими блоками](#Взаємодія блоків).

source: Декларация блока позволяет скрыть его внутреннюю реализацию.
ru_uk: Декларація блоку дозволяє приховати його внутрішню реалізацію.

source: Так как элементы всегда являются внутренней реализацией блока, [обращение к ним](#Взаимодействие-блока-с-его-элементами) возможно только через API самого блока.
ru_uk: Так як елементи завжди є внутрішньою реалізацією блоку, [звернення до них](#Взаємодія-блоку з його елементами) можливо тільки через API самого блоку.

source: Наследование
ru_uk: Спадкування

source: Декларативное описание поведения блоков позволяет использовать методы базового блока внутри производного, наследовать их.
ru_uk: Декларативне опис поведінки блоків дозволяє використовувати методи базового блоку всередині похідного, наслідувати їх.

source: Новый блок может получать все свойства и методы базового.
ru_uk: Новий блок може отримувати всі властивості і методи базового.

source: Также можно создавать цепочки наследования — блок наследуется от другого, который, в свою очередь, наследуется от третьего и т.д.
ru_uk: Також можна створювати ланцюжки спадкування — блок успадковується від іншого, який, у свою чергу, успадковується від третього і т. д.

source: Примеры реализации доступны в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/#Наследование-блока).
ru_uk: Приклади реалізації доступні в документації до [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/#Наследование-блока).

source: Представление динамических блоков в DOM
ru_uk: Подання динамічних блоків в DOM

source: Блокам с JavaScript-реализацией могут соответствовать узлы в HTML.
ru_uk: Блокам з JavaScript-реалізацією можуть відповідати вузли в HTML.

source: В этом случае говорится о том, что **блоки имеют DOM-представление**.
ru_uk: У цьому випадку йдеться про те, що **блоки мають DOM-подання**.

source: В простейшем случае блок соответствует DOM-узлу один к одному.
ru_uk: У найпростішому випадку блок відповідає DOM-вузла один до одного.

source: Однако DOM-узел и блок — это не всегда одно и то же.
ru_uk: Однак DOM-вузол і блок — це не завжди одне і те ж.

source: Можно разместить несколько блоков на одном DOM-узле (это называется [микс](../key-concepts/key-concepts.ru.md#Микс)), а также реализовать один блок на нескольких DOM-узлах.
ru_uk: Можна розмістити кілька блоків на одному DOM-сайті (це називається [мікс](../key-concepts/key-concepts.ru.md#Мікс)), а також реалізувати один блок на декількох DOM-вузлах.

source: Существуют **блоки без DOM-представления**.
ru_uk: Існують **блоки без DOM-подання**.

source: В JavaScript они представлены в виде объектов, имеющих свои методы.
ru_uk: В JavaScript вони представлені у вигляді об'єктів, що мають свої методи.

source: Примеры реализации доступны в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/#Синтаксис-декларации).
ru_uk: Приклади реалізації доступні в документації до [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-decl/#Синтаксис-декларации).

source: Взаимодействие блоков
ru_uk: Взаємодія блоків

source: БЭМ-методология предполагает работу с независимыми блоками.
ru_uk: БЕМ-методологія передбачає роботу з незалежними блоками.

source: Однако на практике полная независимость блоков недостижима.
ru_uk: Однак на практиці повна незалежність блоків недосяжна.

source: Блоки могут взаимодействовать друг с другом с помощью:
ru_uk: Блоки можуть взаємодіяти один з одним за допомогою:

source: Подписки на события других экземпляров блоков.
ru_uk: Підписки на події інших примірників блоків.

source: Подписки на изменения модификаторов.
ru_uk: Підписки на зміни модифікаторів.

source: Непосредственного вызова методов других экземпляров блоков или статических методов класса другого блока.
ru_uk: Безпосереднього виклику методів інших примірників блоків або статичних методів класу іншого блоку.

source: Любых паттернов взаимодействия.
ru_uk: Будь патернів взаємодії.

source: Например, канала событий: все коммуникации происходят благодаря сообщениям, которые компоненты публикуют и слушают с помощью посредника.
ru_uk: Наприклад, каналу подій: всі комунікації відбуваються завдяки повідомленнями, які компоненти публікують і слухають з допомогою посередника.

source: Примеры реализации доступны в документации к [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-interaction/).
ru_uk: Приклади реалізації доступні в документації до [i-bem.js](https://ru.bem.info/technology/i-bem/current/i-bem-js-interaction/).

source: БЭМ-методология рекомендует выстраивать взаимодействие между блоками в иерархическом порядке в соответствии с их расположением в DOM-дереве.
ru_uk: БЕМ-методологія рекомендує вибудовувати взаємодію між блоками в ієрархічному порядку відповідно до їх розташуванням в DOM-дереві.

source: Вложенный блок не должен ничего знать о родительском блоке, так как это нарушает принцип независимости компонентов.
ru_uk: Вкладений блок не повинен нічого знати про батьківському блоці, так як це порушує принцип незалежності компонентів.

source: Взаимодействие блока с его элементами
ru_uk: Взаємодія блоку з його елементами

source: Элемент — это внутренняя реализация блока.
ru_uk: Елемент — це внутрішня реалізація блоку.

source: В БЭМ-методологии принято реализовывать дополнительные хелперы блока для работы с его элементами.
ru_uk: У БЕМ-методології прийнято реалізовувати додаткові хелпери блоку для роботи з його елементами.

source: Обращение напрямую к элементу другого блока невозможно.
ru_uk: Звернення безпосередньо до елементу іншого блоку неможливо.

source: Взаимодействие с элементом происходит только только через API блока, которому принадлежит данный элемент.
ru_uk: Взаємодія з елементом відбувається тільки через API блоку, якому належить даний елемент.
