Repository: OleksandraP/translation
Catalog: methodology/filesystem/filesystem.*.xlf
Languages: ru_uk

source: Организация файловой системы
ru_uk: Організація файлової системи

source: Принятый в методологии БЭМ компонентный подход применяется и к организации БЭМ-проектов в файловой системе.
ru_uk: Прийнятий у методології БЕМ компонентний підхід застосовується і до організації БЕМ-проектів у файловій системі.

source: В БЭМ не только интерфейс делится на независимые компоненты — блоки, но и реализация блоков делится на независимые части — файлы.
ru_uk: У БЕМ не тільки інтерфейс ділиться на незалежні компоненти — блоки, але і реалізація блоків ділиться на незалежні частини — файли.

source: На этой странице вы найдете:
ru_uk: На цій сторінці ви знайдете:

source: [Принципы организации файловой системы](#Принципы-организации-файловой-системы-БЭМ-проекта)
ru_uk: [Принципи організації файлової системи](#Принципи організації файлової системи-БЕМ-проекту)

source: [Пример файловой системы БЭМ-проекта](#Организация-файловой-системы-БЭМ-проекта)
ru_uk: [Приклад файлової системи БЕМ-проекту](#Організація файлової системи-БЕМ-проекту)

source: [Примеры использования уровней переопределения](#Примеры-использования-уровней-переопределения)
ru_uk: [Приклади використання рівнів перевизначення](#Приклади використання-рівнів-перевизначення)

source: Принципы организации файловой системы БЭМ-проекта
ru_uk: Принципи організації файлової системи БЕМ-проекту

source: В БЭМ-проекте код разделяется на мелкие независимые части для удобства работы с отдельными блоками.
ru_uk: У БЕМ-проекті код поділяється на дрібні незалежні частини для зручності роботи з окремими блоками.

source: Перед отправкой в браузер файлы собираются и оптимизируются.
ru_uk: Перед відправкою в браузер файли збираються і оптимізуються.

source: Таким образом мы разграничиваем код, с которым работают люди, и код, который передается в браузер.
ru_uk: Таким чином ми розмежовуємо код, за яким працюють люди, і код, який передається в браузер.

source: В файловой системе код БЭМ-проекта организован по следующим принципам:
ru_uk: У файловій системі код БЕМ-проекту організовано за такими принципами:

source: [Реализация блока разделяется на отдельные файлы](#Реализация-блока-разделяется-на-отдельные-файлы)
ru_uk: [Реалізація блоку розділяється на окремі файли](#Реалізація-блоку-поділяється на окремі файли)

source: [Опциональные элементы и модификаторы выносятся в отдельные файлы](#Опциональные-элементы-и-модификаторы-выносятся-в-отдельные-файлы)
ru_uk: [Необов'язкові елементи і модифікатори виносяться в окремі файли](#Опціональні-елементи-і-модифікатори-виносяться в окремі файли)

source: [Файлы объединяются по смыслу, а не по типу](#Файлы-объединяются-по-смыслу-а-не-по-типу)
ru_uk: [Файли об'єднуються за змістом, а не за типом](#Файли-об'єднуються-за змістом-а-не-по-типу)

source: [Проект разделяется на уровни переопределения](#Проект-разделяется-на-уровни-переопределения)
ru_uk: [Проект розділяється на рівні перевизначення](#Проект розділяється на рівні-перевизначення)

source: Реализация блока разделяется на отдельные файлы
ru_uk: Реалізація блоку розділяється на окремі файли

source: Набор файлов блока (например, `input.css`, `input.js`) зависит от [технологий](../key-concepts/key-concepts.ru.md#Технология-реализации), входящих в реализацию блока.
ru_uk: Набір файлів блоку (наприклад, `input.css`, `input.js`) залежить від [технологій](../key-concepts/key-concepts.ru.md#Технологія-реалізації), що входять в реалізацію блоку.

source: *Зачем?*
ru_uk: *Навіщо?*

source: **Улучшение навигации по проекту**
ru_uk: **Поліпшення навігації по проекту**

source: Структура проекта построена по единому принципу, а имена блоков уникальны.
ru_uk: Структура проекту побудована за єдиним принципом, а імена блоків унікальні.

source: Это позволяет разработчикам быстро ориентироваться в разных частях проекта и находить нужные файлы.
ru_uk: Це дозволяє розробникам швидко орієнтуватися в різних частинах проекту і знаходити потрібні файли.

source: **Упрощение переноса блоков между проектами**
ru_uk: **Спрощення перенесення блоків між проектами**

source: Реализация блоков разделена по отдельным файлам.
ru_uk: Реалізація блоків розділена по окремих файлів.

source: При переносе блока из проекта в проект достаточно скопировать нужные файлы или директории.
ru_uk: При перенесенні блоку з проекту в проект достатньо скопіювати потрібні файли або теки.

source: Опциональные элементы и модификаторы выносятся в отдельные файлы
ru_uk: Додаткові елементи і модифікатори виносяться в окремі файли

source: *Зачем?*
ru_uk: *Навіщо?*

source: **Подключение только нужной реализации блока**
ru_uk: **Підключення тільки потрібної реалізації блоку**

source: В сборку подключаются только файлы, действительно необходимые для данной реализации блока.
ru_uk: У збірку підключаються тільки файли, які дійсно необхідні для даної реалізації блоку.

source: Файлы объединяются по смыслу, а не по типу
ru_uk: Файли об'єднуються за змістом, а не за типом

source: Файлы блока группируются с помощью общих [правил именования](../naming-convention/naming-convention.ru.md).
ru_uk: Файли блоку групуються з допомогою загальних [правил іменування](../naming-convention/naming-convention.ru.md).

source: Для удобства работы они могут быть объединены в директорию этого блока.
ru_uk: Для зручності роботи вони можуть бути об'єднані в директорію цього блоку.

source: *Зачем?*
ru_uk: *Навіщо?*

source: **Подключение в проект только необходимых блоков**
ru_uk: **Підключення у проект тільки необхідних блоків**

source: Блоки реализованы независимо.
ru_uk: Блоки реалізовані незалежно.

source: Это позволяет настраивать сборку так, чтобы в проект попадали только нужные блоки.
ru_uk: Це дозволяє налаштовувати збірку так, щоб у проект потрапляли тільки потрібні блоки.

source: Проект разделяется на уровни переопределения
ru_uk: Проект розділяється на рівні перевизначення

source: Конечная реализация блока может быть разделена по [уровням переопределения](#Примеры-использования-уровней-переопределения).
ru_uk: Кінцева реалізація блоку може бути розділена за [рівнями перевизначення](#Приклади використання-рівнів-перевизначення).

source: *Зачем?*
ru_uk: *Навіщо?*

source: **Отсутствие дублирования кода**
ru_uk: **Відсутність дублювання коду**

source: Вынесение общей реализации для всех платформ на отдельный уровень позволяет избежать дублирования кода и сократить время на отладку проекта.
ru_uk: Винесення загальної реалізації для всіх платформ на окремий рівень дозволяє уникнути дублювання коду та скоротити час на налагодження проекту.

source: **Переопределение и доопределение блоков готовых библиотек**
ru_uk: **Перевизначення і доопределение блоків готових бібліотек**

source: Изменение блока библиотеки не требует его копирования на уровень проекта.
ru_uk: Зміна блоку бібліотеки не вимагає його копіювання рівень проекту.

source: Достаточно создать требуемый файл с правками или новым кодом на другом уровне переопределения и подключить в сборку.
ru_uk: Досить створити потрібний файл з правками або новим кодом на іншому рівні перевизначення і підключити в збірку.

source: **Обновление подключенных в проект библиотек**
ru_uk: **Оновлення підключених в проект бібліотек**

source: Разделение проекта на уровни позволяет изменять блоки, не затрагивая код библиотеки.
ru_uk: Поділ проекту на рівні дозволяє змінювати блоки, не зачіпаючи код бібліотеки.

source: При обновлении библиотеки модификация блоков сохраняется на другом уровне проекта.
ru_uk: При оновленні бібліотеки модифікація блоків зберігається на іншому рівні проекту.

source: Организация файловой системы БЭМ-проекта
ru_uk: Організація файлової системи БЕМ-проекту

source: Блоку соответствует директория в файловой системе.
ru_uk: Блоку відповідає директорія у файловій системі.

source: Имена блока и его директории совпадают.
ru_uk: Імена блоку і його директорії збігаються.

source: blocks/ input/ # Директория блока input button/ # Директория блока button
ru_uk: blocks/ input/ # Директорія блоку input button/ # Директорія блоку button

source: Реализация блока разделена на отдельные файлы — файлы технологий.
ru_uk: Реалізація блоку розділена на окремі файли — файли технологій.

source: Имена файлов совпадают с именем блока.
ru_uk: Імена файлів збігаються з ім'ям блоку.

source: Расширение соответствует технологии.
ru_uk: Розширення відповідає технології.

source: blocks/ input/ input.css # Реализация блока `input` в технологии CSS input.js # Реализация блока `input` в технологии JavaScript button/ button.css button.js button.png
ru_uk: blocks/ input/ input.css # Реалізація блоку `input` в технології CSS input.js # Реалізація блоку `input` в технології JavaScript button/ button.css button.js button.png

source: Имена файлов и директорий [БЭМ-сущностей](../key-concepts/key-concepts.ru.md#БЭМ-сущность) соответствуют [соглашению по именованию](../naming-convention/naming-convention.ru.md):
ru_uk: Імена файлів і директорій [БЕМ-сутностей](../key-concepts/key-concepts.ru.md#БЕМ-сутність) відповідають [згоди щодо іменування](../naming-convention/naming-convention.ru.md):

source: Элемент — `block__elem.extension` (`input__box.css`).
ru_uk: Елемент — `block__elem.extension` (`input__box.css`).

source: Модификатор блока — `block_mod_val.extension` (`input_type_search.css`) или `block_mod.extension` (`input_disabled.css`).
ru_uk: Модифікатор блоку — `block_mod_val.extension` (`input_type_search.css`) або `block_mod.extension` (`input_disabled.css`).

source: Значение булевого модификатора не указывается.
ru_uk: Значення булевого модифікатора не вказується.

source: Модификатор элемента — `block__elem_mod_val.extension` (`input__clear_size_large.css`) или `block__elem_mod.extension` (`input__clear_visible.css`).
ru_uk: Модифікатор елемента — `block__elem_mod_val.extension` (`input__clear_size_large.css`) або `block__elem_mod.extension` (`input__clear_visible.css`).

source: Модификаторы и элементы выделяются в отдельные файлы и группируются в поддиректории блока с соответствующими именами.
ru_uk: Модифікатори і елементи виділяються в окремі файли групуються в піддиректорії блоку з відповідними іменами.

source: blocks/ input/ _type/ # Директория модификатора `type` input_type_search.css # Реализация модификатора `type` # со значением `search` в технологии CSS __box/ # Директория элемента `box` input__box.css input.css input.js button/ button.css button.js button.png
ru_uk: blocks/ input/ _type/ # Директорія модифікатора `type` input_type_search.css # Реалізація модифікатора `type` # зі значенням `search` в технології CSS __box/ # Директорія елемента `box` input__box.css input.css input.js button/ button.css button.js button.png

source: При создании модификаторов с разными значениями (например, `popup_target_anchor.extension` и `popup_target_position.extension`), общий код может быть вынесен в отдельный файл (`popup_target.extension`) без указания значения модификатора в имени.
ru_uk: При створенні модифікаторів з різними значеннями (наприклад, `popup_target_anchor.extension` і `popup_target_position.extension`), загальний код може бути винесений в окремий файл (`popup_target.extension`) без зазначення значення модифікатора в імені.

source: blocks/ popup/ _target/ popup_target.css # Общий код модификатора `target` popup_target_anchor.css # Модификатор `target` в значении `anchor` popup_target_position.css # Модификатор `target` в значении `position` _visible/ popup_visible.css # Булевый модификатор visible popup.css popup.js
ru_uk: blocks/ popup/ _target/ popup_target.css # Загальний код модифікатора `target` popup_target_anchor.css # Модифікатор `target` у значенні `якір` popup_target_position.css # Модифікатор `target` у значенні `position` _visible/ popup_visible.css # Булевий модифікатор visible popup.css popup.js

source: Примеры из жизни
ru_uk: Приклади з життя

source: Примеры использования уровней переопределения
ru_uk: Приклади використання рівнів перевизначення

source: Реализация блока может быть разделена по [уровням переопределения](../key-concepts/key-concepts.ru.md#Уровень-переопределения).
ru_uk: Реалізація блоку може бути розділена за [рівнями перевизначення](../key-concepts/key-concepts.ru.md#Рівень-перевизначення).

source: Рассмотрим несколько примеров:
ru_uk: Розглянемо кілька прикладів:

source: [Подключение библиотеки](#Подключение-библиотеки)
ru_uk: [Підключення бібліотеки](#Підключення бібліотеки)

source: [Разделение проекта на платформы](#Разделение-проекта-на-платформы)
ru_uk: [Поділ проекту на платформи](#Поділ проекту на-платформи)

source: Подключение библиотеки
ru_uk: Підключення бібліотеки

source: В проект можно подключить библиотеку как отдельный уровень.
ru_uk: У проект можна підключити бібліотеку як окремий рівень.

source: Изменять (до- или переопределять) блоки можно на другом уровне проекта.
ru_uk: Змінювати (до - або ігнорувати) блоки можна на іншому рівні проекту.

source: При сборке подключится исходная реализация блоков с уровня библиотеки и переопределенная — с уровня проекта.
ru_uk: При складанні підключиться вихідна реалізація блоків з бібліотеки рівня і переопределенная — з рівня проекту.

source: Такое разделение позволяет сохранить изменения в блоках при обновлении библиотеки.
ru_uk: Такий поділ дозволяє зберегти зміни в блоках при оновленні бібліотеки.

source: Код самой библиотеки обновится, а специфическая реализация блоков проекта останется прежней, так как находится на другом уровне проекта.
ru_uk: Код бібліотеки оновиться, а специфічна реалізація блоків проекту залишиться колишньою, так як знаходиться на іншому рівні проекту.

source: library.blocks/ button/ button.css # CSS-реализация кнопки в библиотеке (высота 20px) project.blocks/ button/ button.css # Переопределение на уровне проекта (высота 24px)
ru_uk: library.blocks/ button/ button.css # CSS-реалізація кнопки в бібліотеці (висота 20px) project.blocks/ button/ button.css # Перевизначення на рівні проекту (висота 24px)

source: Разделение проекта на платформы
ru_uk: Поділ проекту на платформи

source: Проект разделен на платформы (`mobile` и `desktop`) и соответствующие уровни переопределения в файловой системе.
ru_uk: Проект розділений на платформи (`mobile` і `desktop") та відповідні рівні зміни у файловій системі.

source: Уровень `common` содержит общую реализацию блоков для всех платформ.
ru_uk: Рівень `common` містить загальну реалізацію блоків для всіх платформ.

source: На уровне `desktop` и `mobile` находится специфика реализаций блоков, характерная для каждой из платформ.
ru_uk: На рівні `desktop` і `mobile` знаходиться специфіка реалізацій блоків, характерна для кожної з платформ.

source: Рассмотрим на примере:
ru_uk: Розглянемо на прикладі:

source: common.blocks/ button/ button.css # Базовая CSS-реализация кнопки desktop.blocks/ button/ button.css # Особенности кнопки для desktop mobile.blocks/ button/ button.css # Особенности кнопки для mobile
ru_uk: common.blocks/ button/ button.css # Базова CSS-реалізація кнопки desktop.blocks/ button/ button.css # Особливості кнопки для desktop mobile.blocks/ button/ button.css # Особливості кнопки для mobile

source: При сборке в файл `desktop.css` попадут все базовые CSS-правила кнопки с уровня `common` и переопределенные правила с уровня `desktop`.
ru_uk: При зборці в файл `desktop.css` потраплять всі базові CSS-правила кнопки з рівня `common` і перевизначені правила з рівня `desktop`.

source: Базовые CSS-правила
ru_uk: Базові CSS-правила

source: Особенности desktop
ru_uk: Особливості desktop

source: Файл `mobile.css` будет включать базовые CSS-правила кнопки с уровня `common` и переопределенные правила с уровня `mobile`.
ru_uk: Файл `mobile.css` буде включати базові CSS-правила кнопки з рівня `common` і перевизначені правила з рівня `mobile`.

source: Базовые CSS-правила
ru_uk: Базові CSS-правила

source: Особенности mobile
ru_uk: Особливості mobile
